{
  "title": "IS1106 Foundations of Web Technologies",
  "topic": "Web Development",
  "content": [
    {
      "id": 1,
      "type": "section",
      "level": 1,
      "path": "Foundations of Web Technologies",
      "exam_text": "This topic introduces the client-server model and distinguishes between static web pages (fixed content) and dynamic web pages (generated content), which can be client-side or server-side.",
      "full_text": "This lesson covers the fundamental relationship between clients (browsers) and servers, and explains how web pages are delivered. It distinguishes between static pages, which have fixed content, and dynamic pages, where content is generated on-the-fly. It further breaks down dynamic pages into client-side and server-side processing.",
      "exam_critical": true,
      "analogy": "It's like the difference between reading a printed book (static) and browsing a social media feed that's constantly updating with personalized content (dynamic).",
      "key_sentence": "This lesson covers the fundamental relationship between clients (browsers) and servers, and explains how web pages are delivered.",
      "note": "Course Overview",
      "simple_explanation": "This is about how websites work. We'll look at your computer (the client) asking for a website from a big computer (the server), and the difference between a simple, unchanging webpage and a complex, interactive one like Facebook.",
      "title": "Static Vs Dynamic Web Pages",
      "why_exists": "To understand how the web works, you need to know the basic building blocks: who asks for information, who provides it, and the different ways that information can be prepared.",
      "subtitle": "Foundations of Web Technologies"
    },
    {
      "id": 2,
      "type": "section",
      "level": 2,
      "path": "Foundations of Web Technologies > The Client/Server Model",
      "exam_text": "The client/server model describes a relationship where a 'client' program requests services or resources from a 'server' program, which fulfills the request over a network.",
      "full_text": "The client/server model is a fundamental concept in networking that describes the relationship between two computer programs:\n• The <mark-key>Client</mark-key> (e.g., a web browser) requests a service or resource.\n• The <mark-key>Server</mark-key> (e.g., a web server) fulfills the request and sends the results back over a network.\nIn web technologies, your browser is the client, and the computer hosting the website is the server.",
      "exam_critical": true,
      "analogy": "Like ordering a pizza. You (the client) call the pizza place (the server) to request a pizza. The server makes it and delivers it back to you.",
      "key_sentence": "The client/server model describes a relationship where a 'client' program requests services from a 'server' program, which fulfills the request over a network.",
      "note": "Core Architecture",
      "parent": 1,
      "simple_explanation": "Imagine you're at a restaurant. You (the client) order food from the waiter. The kitchen (the server) prepares your order and sends it back to you. The internet works the same way: your browser orders a webpage, and a server prepares and sends it.",
      "title": "The Client/Server Model",
      "why_exists": "This model was created to efficiently distribute tasks between computers. Instead of one giant computer doing everything, specialized servers can handle many requests from many different clients.",
      "subtitle": "The Client/Server Model"
    },
    {
      "id": 3,
      "type": "concept",
      "level": 3,
      "path": "Foundations of Web Technologies > The Client/Server Model > Web Client",
      "exam_text": "A Web Client is typically a web browser (like Chrome or Firefox) that connects to the internet to request and receive web pages from a server using HTTP.",
      "full_text": "A Web Client is the software that a user interacts with to access the web. Key characteristics include:\n• **Software:** Usually a web browser like Chrome, Firefox, or Safari.\n• **Connection:** Connects to the internet on-demand.\n• **Protocol:** Uses <mark-key>HTTP (Hypertext Transfer Protocol)</mark-key> to communicate.\n• **Function:** Its primary job is to request web pages from a server and display them to the user.",
      "exam_critical": false,
      "analogy": "It's the TV in your living room. It doesn't create the shows; it just requests them from the cable company (the server) and displays them on the screen for you to watch.",
      "key_sentence": "A Web Client is typically a web browser that connects to the internet to request and receive web pages from a server using HTTP.",
      "note": "Browser's Role",
      "parent": 2,
      "simple_explanation": "The 'client' is just your web browser app, like Chrome or Safari. Its job is to ask for websites and show them to you.",
      "title": "Web Client",
      "why_exists": "Users needed a simple application to navigate the web, interpret HTML code, and display it in a user-friendly format. The web browser was created for this purpose.",
      "subtitle": "Web Client"
    },
    {
      "id": 4,
      "type": "concept",
      "level": 3,
      "path": "Foundations of Web Technologies > The Client/Server Model > Web Server",
      "exam_text": "A Web Server is a computer that is always connected to the internet, runs server software (like Apache), and responds to HTTP requests from clients by sending web pages.",
      "full_text": "A Web Server is a powerful computer that stores website files and makes them available to clients. Key characteristics include:\n• **Software:** Runs specialized web server software like Apache or Internet Information Server (IIS).\n• **Connection:** Continually connected to the Internet to listen for requests.\n• **Protocol:** Also uses <mark-key>HTTP</mark-key> to communicate.\n• **Function:** Its job is to receive requests for web pages, locate the required files, and transmit them back to the client's browser.",
      "exam_critical": false,
      "analogy": "It's the library. It's always open, stores all the books (website files), and when you (the client) ask for a specific book, the librarian (server software) finds it and gives it to you.",
      "key_sentence": "A Web Server is a computer that is always connected to the internet, runs server software, and responds to HTTP requests from clients by sending web pages.",
      "note": "Website Host",
      "parent": 2,
      "simple_explanation": "The 'server' is a powerful computer that's on 24/7, holding all the files for a website. When you type a web address, you're sending a message to that computer, and it sends the website files back to your browser.",
      "title": "Web Server",
      "why_exists": "Websites needed a central, reliable place to be stored and accessed by anyone on the internet at any time. A dedicated, always-on server computer fulfills this need.",
      "subtitle": "Web Server"
    },
    {
      "id": 5,
      "type": "section",
      "level": 2,
      "path": "Foundations of Web Technologies > Static vs. Dynamic Web Pages",
      "exam_text": "Static web pages have fixed content delivered exactly as stored. Dynamic web pages have content generated 'on-the-fly' by a program or script when requested, allowing for personalization.",
      "full_text": "Web pages can be categorized based on how their content is created:\n\n• <mark-key>Static Web Pages</mark-key>: The content is fixed and pre-written in HTML files. The server simply finds the file and sends it. Everyone sees the exact same page.\n\n• <mark-key>Dynamic Web Pages</mark-key>: The content is generated by a script or program at the moment of the request. This allows for personalized content, interactivity, and data from databases.",
      "exam_critical": true,
      "analogy": "Static is buying a pre-made lunch box from a shop. Dynamic is ordering custom noodles at a stall where you pick the ingredients and they cook it for you on the spot.",
      "key_sentence": "Static web pages have fixed content delivered exactly as stored, while dynamic web pages have content generated 'on-the-fly' by a program or script.",
      "note": "Key Difference",
      "parent": 1,
      "simple_explanation": "A static page is like a printed flyer—everyone gets the same one. A dynamic page is like your Instagram feed—it's custom-built just for you with the latest posts every time you open the app.",
      "title": "Static vs. Dynamic Web Pages",
      "why_exists": "While static pages are simple and fast, the web needed a way to show changing information (like news headlines or social media posts) and interact with users, which led to the development of dynamic pages.",
      "subtitle": "Static vs. Dynamic Web Pages"
    },
    {
      "id": 6,
      "type": "concept",
      "level": 3,
      "path": "Foundations of Web Technologies > Static vs. Dynamic Web Pages > Static Web Pages",
      "exam_text": "A static web page is an HTML file with fixed content. The server sends the file to the browser without any changes, meaning every user sees the identical page.",
      "full_text": "A <mark-key>static web page</mark-key> is a document that is stored on the server in the exact form the user will see it. Its contents remain unchanged unless a developer manually edits the source file.\n\n**Process:**\n1. Client requests a web page.\n2. Web server locates the corresponding HTML file.\n3. The server sends the complete HTML file back to the client.\n4. The client's browser formats and displays the HTML file.\n\nThe content is fixed and does not change based on user interaction or other factors.",
      "exam_critical": false,
      "analogy": "It's like a restaurant's printed menu. The menu is already made, and the waiter just hands you a copy. It doesn't change based on who you are or what time of day it is.",
      "key_sentence": "A static web page is a document that is stored on the server in the exact form the user will see it.",
      "note": "Fixed Content",
      "parent": 5,
      "simple_explanation": "A static page is like a PDF or a Word document saved on a server. When you ask for it, the server just sends you that exact file. It's simple, fast, and the same for everyone.",
      "title": "Static Web Pages",
      "why_exists": "This was the original way web pages were made. It's a simple, fast, and efficient way to deliver information that doesn't need to change often, like an 'About Us' page or a blog post.",
      "subtitle": "Static Web Pages"
    },
    {
      "id": 7,
      "type": "concept",
      "level": 3,
      "path": "Foundations of Web Technologies > Static vs. Dynamic Web Pages > Dynamic Web Pages",
      "exam_text": "A dynamic web page has content generated 'on-the-fly' by a script based on user requests, database information, or other parameters. The content can change each time it is viewed.",
      "full_text": "A <mark-key>dynamic web page</mark-key> is a page whose content is created by a program or script at the time of the request. This allows for personalized and interactive experiences.\n\n**Characteristics:**\n• Content is generated 'on-the-fly' by the server or client.\n• Can display different content for different users.\n• Can interact with databases to retrieve or store information.\n• Examples include showing the current date/time, a personalized welcome message, or a social media feed.",
      "exam_critical": true,
      "analogy": "Ordering at a noodle stall. You specify the ingredients you want, and the cook ('server') makes a custom bowl of noodles just for you. Someone else can order a completely different bowl.",
      "key_sentence": "A dynamic web page is a page whose content is created by a program or script at the time of the request.",
      "note": "Generated Content",
      "parent": 5,
      "simple_explanation": "A dynamic page is like a custom report. When you ask for it, a program runs, pulls the latest info (like your latest emails or the current weather), and builds a unique page just for you, right at that moment.",
      "title": "Dynamic Web Pages",
      "why_exists": "Websites needed to be more than just digital brochures. They needed to handle user logins, display real-time data, and provide personalized experiences, which is impossible with static pages.",
      "subtitle": "Dynamic Web Pages"
    },
    {
      "id": 8,
      "type": "section",
      "level": 2,
      "path": "Foundations of Web Technologies > Client-Side vs. Server-Side Scripting",
      "exam_text": "Dynamic web pages are created using scripts that run in one of two places: on the client's computer (client-side) or on the web server (server-side).",
      "full_text": "Dynamic content is generated by scripts, but where those scripts run is a critical distinction:\n\n• <mark-critical>Client-Side Scripting</mark-critical>: The script code is sent to the user's browser, and the browser itself executes it to change the page. This is great for interactivity and quick UI updates.\n\n• <mark-critical>Server-Side Scripting</mark-critical>: The script runs on the web server. It processes the request, builds the final HTML page, and then sends that finished page to the browser. This is necessary for secure operations and database access.",
      "exam_critical": true,
      "analogy": "It's like cooking. Server-side is ordering a fully cooked pizza for delivery. Client-side is buying a frozen pizza and cooking it in your own oven.",
      "key_sentence": "Dynamic web pages are created using scripts that run in one of two places: on the client's computer (client-side) or on the web server (server-side).",
      "note": "Where Code Runs",
      "parent": 1,
      "simple_explanation": "Imagine building a LEGO set. 'Server-side' is when the LEGO factory builds the model for you and ships you the finished product. 'Client-side' is when the factory ships you the box of bricks and the instructions, and you build it yourself at home.",
      "title": "Client-Side vs. Server-Side Scripting",
      "why_exists": "Some tasks are better handled by the user's powerful computer (like animations), while others must be handled securely on the server (like processing a payment). This division of labor makes websites both efficient and secure.",
      "subtitle": "Client-Side vs. Server-Side Scripting"
    },
    {
      "id": 9,
      "type": "concept",
      "level": 3,
      "path": "Foundations of Web Technologies > Client-Side vs. Server-Side Scripting > Client-Side Scripting",
      "exam_text": "Client-side scripting code (like JavaScript) runs in the user's web browser after the page is loaded. It is used for interactivity, form validation, and modifying the page without reloading.",
      "full_text": "<mark-key>Client-side scripting</mark-key> involves sending scripts to the client's browser to be executed locally. The server sends HTML, CSS, and script files, and the browser processes them to create the dynamic page.\n\n**Key Features:**\n• **Execution Location:** Runs on the client's computer (in the browser).\n• **Primary Language:** <mark-critical>JavaScript</mark-critical> is the dominant language.\n• **Common Uses:**\n  - Interactive user interfaces (e.g., clicking a button to show/hide content).\n  - Validating forms for errors *before* submitting to the server.\n  - Making small updates to the page without a full reload.\n• **Security:** The source code is visible to the user ('View Source').",
      "exam_critical": true,
      "analogy": "It's like the assembly instructions that come with IKEA furniture. The factory (server) sends you the flat-packed parts and instructions, and you do the work of putting it together in your own home (the browser).",
      "key_sentence": "Client-side scripting code runs in the user's web browser after the page is loaded.",
      "note": "Runs in Browser",
      "parent": 8,
      "simple_explanation": "This is code that runs on your own computer inside your browser. It's used for all the cool interactive stuff on a page, like checking if you entered a valid email in a form or making a menu pop up when you click it.",
      "title": "Client-Side Scripting",
      "why_exists": "To make web pages feel more like applications and less like static documents. It offloads simple tasks to the user's computer, reducing server load and making the user experience faster and more responsive.",
      "subtitle": "Client-Side Scripting"
    },
    {
      "id": 10,
      "type": "concept",
      "level": 3,
      "path": "Foundations of Web Technologies > Client-Side vs. Server-Side Scripting > Server-Side Scripting",
      "exam_text": "Server-side scripting code (like PHP or Python) runs on the web server to process requests, access databases, and generate a custom HTML page before sending it to the browser.",
      "full_text": "<mark-key>Server-side scripting</mark-key> means the script is executed on the web server before the web page is sent to the client. The browser only receives the final HTML output.\n\n**Key Features:**\n• **Execution Location:** Runs on the web server.\n• **Languages:** Common languages include <mark-critical>PHP, Python, Ruby, and JSP</mark-critical>.\n• **Common Uses:**\n  - Accessing and managing databases (e.g., retrieving user profiles).\n  - Processing user input from forms (e.g., login credentials).\n  - Creating customized web pages based on user data.\n• **Security:** The source code remains hidden and secure on the server.",
      "exam_critical": true,
      "analogy": "It's like a chef in a restaurant kitchen. You place an order (request), and the chef (server script) uses various ingredients (data) to prepare a finished dish (HTML page) and then sends it out to your table. You don't see how it was made.",
      "key_sentence": "Server-side scripting code runs on the web server to process requests and generate a custom HTML page before sending it to the browser.",
      "note": "Runs on Server",
      "parent": 8,
      "simple_explanation": "This is code that runs on the website's main computer (the server). It does the heavy lifting, like logging you in, fetching your data from a database, and building a custom webpage for you. Your browser only gets the final result.",
      "title": "Server-Side Scripting",
      "why_exists": "To handle tasks that require security (like passwords), access to centralized resources (like a database), or complex logic that shouldn't be exposed to the user.",
      "subtitle": "Server-Side Scripting"
    },
    {
      "id": 11,
      "type": "list",
      "level": 3,
      "path": "Foundations of Web Technologies > Client-Side vs. Server-Side Scripting > Comparison",
      "exam_text": "Server-side scripting runs on the server, is secure, and can access databases. Client-side scripting runs in the browser, is faster for UI tasks, but its code is visible.",
      "full_text": "The choice between server-side and client-side scripting depends on the task at hand.",
      "exam_critical": true,
      "analogy": "Server-side is the bank vault where your money is securely stored and managed. Client-side is the ATM interface you use to interact with your account—it's fast and user-friendly, but the real security and logic happen back at the bank.",
      "items": [
        "EXAM: Execution Location | FULL: **Server-Side**: Runs on the web server. | **Client-Side**: Runs in the user's web browser.",
        "EXAM: Source Code Visibility | FULL: **Server-Side**: Source code is hidden from the user. | **Client-Side**: Source code is visible to the user.",
        "EXAM: Database Access | FULL: **Server-Side**: Can directly connect to and interact with databases. | **Client-Side**: Cannot connect to databases directly.",
        "EXAM: Response Time | FULL: **Server-Side**: Slower, as it requires a round-trip to the server. | **Client-Side**: Quicker for UI changes, as it runs locally.",
        "EXAM: Security | FULL: **Server-Side**: More secure; ideal for sensitive operations. | **Client-Side**: Less secure; user can view and manipulate the script.",
        "EXAM: Common Languages | FULL: **Server-Side**: PHP, Python, Ruby, ASP. | **Client-Side**: JavaScript, HTML, CSS."
      ],
      "key_sentence": "Server-side scripting runs on the server and is secure, while client-side scripting runs in the browser and is faster for UI tasks.",
      "note": "Key Trade-offs",
      "parent": 8,
      "simple_explanation": "Server-side is for secret, heavy-duty stuff like checking passwords and getting data. Client-side is for fast, visible stuff that makes the page interactive, like form checks and animations.",
      "title": "Comparison: Server-Side vs. Client-Side Scripting",
      "why_exists": "Developers need a clear understanding of the trade-offs to build efficient and secure web applications, using each type of scripting for what it does best.",
      "subtitle": "Comparison"
    },
    {
      "id": 12,
      "type": "list",
      "level": 3,
      "path": "Foundations of Web Technologies > Client-Side vs. Server-Side Scripting > Use Cases",
      "exam_text": "Use client-side for interactivity and form validation. Use server-side for database access, security, and tracking user information across pages.",
      "full_text": "Choosing the right type of scripting is crucial for web development:",
      "exam_critical": true,
      "analogy": "It's like managing a retail store. Client-side is the friendly salesperson on the floor helping you find items and answering quick questions. Server-side is the manager in the back office handling inventory, security, and employee records.",
      "items": [
        "EXAM: Use Client-Side When... | FULL: You need **highly interactive pages** or **dynamic forms** with instant validation (e.g., checking if an email address format is correct before submission).",
        "EXAM: Use Server-Side When... | FULL: You need to **protect your source code**, **interact with a database**, or **track user information** across multiple pages (like a shopping cart or login session)."
      ],
      "key_sentence": "Use client-side for interactivity and form validation; use server-side for database access, security, and tracking user information.",
      "note": "Decision Guide",
      "parent": 8,
      "simple_explanation": "Use client-side (JavaScript) when you want to make your website fun and easy to use without waiting for the server. Use server-side (PHP, Python) when you need to do serious, secure work like handling logins or saving data.",
      "title": "Which Should I Use? Client- or Server-Side?",
      "why_exists": "To provide a clear guide for developers on how to structure their applications, ensuring that tasks are performed in the most appropriate, efficient, and secure location.",
      "subtitle": "Use Cases"
    }
  ]
}