{
  "title": "Fundamentals of Mathematics - Chapter 07: Properties of Relations",
  "topic": "Discrete Mathematics",
  "content": [
    {
      "id": 1,
      "type": "section",
      "level": 1,
      "path": "Properties of Relations",
      "title": "Properties of Relations",
      "exam_text": "Relations can be classified by properties such as reflexivity, symmetry, and transitivity. These properties define the fundamental nature of the relationship between elements in a set.",
      "full_text": "There are several important properties that are used to classify relations on a set. Understanding these properties allows us to categorize relationships and understand their structure, which is fundamental in areas like database design, network theory, and logic.\n\nThe main properties we will cover are:\n• **Reflexivity**\n• **Symmetry**\n• **Antisymmetry**\n• **Transitivity**",
      "key_sentence": "There are several important properties that are used to classify relations on a set.",
      "simple_explanation": "Think of relationships like 'is friends with' or 'is older than'. We have special names for the rules these relationships follow, like whether it's a two-way street or if it can form a chain.",
      "analogy": "It's like classifying vehicles. Some are cars, some are trucks, some are motorcycles. They all move people around, but we classify them based on their properties (number of wheels, engine size, purpose). We do the same for mathematical relations.",
      "why_exists": "To create a formal language for describing how elements in a set interact. This classification is the foundation for more complex concepts like ordering and equivalence.",
      "note": "Core Concepts",
      "exam_critical": true,
      "subtitle": "Properties of Relations"
    },
    {
      "id": 2,
      "type": "concept",
      "level": 2,
      "path": "Properties of Relations > Reflexive Relations",
      "title": "Reflexive Relations",
      "exam_text": "A relation R on a set X is <mark-key>reflexive</mark-key> if every element is related to itself. This means for every x in X, the pair (x, x) must be in R.",
      "full_text": "A relation R on a set X is called <mark-key>reflexive</mark-key> if (x, x) ∈ R for every element x ∈ X.\n\n<mark-important>For a relation to be reflexive, it must contain the self-relating pair for **every single element** in the set. If even one is missing, the relation is not reflexive.</mark-important>",
      "key_sentence": "A relation R on a set X is called reflexive if (x, x) ∈ R for every element x ∈ X.",
      "simple_explanation": "A relationship is reflexive if everything is related to itself. For example, the rule 'is equal to' is reflexive because every number is equal to itself (5 = 5).",
      "analogy": "It's like looking in a mirror. Every person is 'related' to their own reflection. A reflexive relation requires every person in the group to have a mirror.",
      "why_exists": "To define relations where self-identity is an inherent part of the relationship, such as equality (=) or 'is a subset of' (⊆), which are foundational in mathematics and logic.",
      "note": "Must relate to self",
      "exam_critical": true,
      "parent": 1,
      "subtitle": "Reflexive Relations"
    },
    {
      "id": 3,
      "type": "example",
      "level": 3,
      "path": "Properties of Relations > Reflexive Relations > Example: '≤' Relation",
      "exam_text": "*The relation R on X={1,2,3,4} where x ≤ y is reflexive because (1,1), (2,2), (3,3), and (4,4) are all valid pairs under this rule.*",
      "full_text": "Let the relation R on the set X={1,2,3,4} be defined by the rule (x, y) ∈ R if and only if x ≤ y.\n\nThis relation is **reflexive**. To check, we must verify that (x, x) ∈ R for every x in X.\n• Is (1, 1) in R? Yes, because 1 ≤ 1.\n• Is (2, 2) in R? Yes, because 2 ≤ 2.\n• Is (3, 3) in R? Yes, because 3 ≤ 3.\n• Is (4, 4) in R? Yes, because 4 ≤ 4.\n\nSince the condition holds for all elements, the relation is reflexive.",
      "key_sentence": "R is reflexive because for each element x ∈ X, (x, x) ∈ R; specifically (1,1), (2,2), (3,3) and (4,4) are each in R.",
      "simple_explanation": "The rule is 'is less than or equal to'. Since 1 is equal to 1, 2 is equal to 2, and so on for all numbers in the set, the rule works for every number with itself. So, it's reflexive.",
      "analogy": "It's like asking if everyone in your family has the same last name as themselves. Of course, they do. The 'less than or equal to' rule always works for a number and itself.",
      "why_exists": "To provide a concrete case of a reflexive relation that is defined by a mathematical rule rather than an explicit list of pairs.",
      "exam_critical": false,
      "parent": 2,
      "subtitle": "Example: '≤' Relation"
    },
    {
      "id": 4,
      "type": "example",
      "level": 3,
      "path": "Properties of Relations > Reflexive Relations > Example: Non-Reflexive Relation",
      "exam_text": "*The relation R = {(a, a), (b, c), (c, b),(d, d)} on X = {a, b, c, d} is not reflexive because the pair (b, b) is missing.*",
      "full_text": "Let the relation R = {(a, a), (b, c), (c, b),(d, d)} on the set X = {a, b, c, d}.\n\nThis relation is **not reflexive**. For a relation to be reflexive on X, it must contain (x, x) for **every** element x in X. In this case, the element `b` is in X, but the pair (b, b) is not in R. The same is true for the element `c`.\n\nBecause at least one required pair is missing, the entire relation fails the reflexive test.",
      "key_sentence": "This relation is not reflexive because the element b ∈ X but (b, b) ∉ R.",
      "simple_explanation": "The set has a, b, c, and d. To be reflexive, the list of pairs needs to include (a,a), (b,b), (c,c), and (d,d). This list is missing (b,b) and (c,c), so it fails the test.",
      "analogy": "Imagine a club where everyone is supposed to get a name tag with their own name. If 'Bob' is in the club but doesn't get a 'Bob' name tag, the rule isn't being followed for everyone. The relation is not reflexive.",
      "why_exists": "To show a counter-example and emphasize that the reflexive property must hold for every element in the set without exception.",
      "note": "Common mistake",
      "exam_critical": false,
      "parent": 2,
      "subtitle": "Example: Non-Reflexive Relation"
    },
    {
      "id": 5,
      "type": "concept",
      "level": 2,
      "path": "Properties of Relations > Symmetric Relations",
      "title": "Symmetric Relations",
      "exam_text": "A relation R is <mark-key>symmetric</mark-key> if whenever (x, y) is in R, its reverse pair (y, x) is also in R. It represents a two-way relationship.",
      "full_text": "A relation R on a set X is called <mark-key>symmetric</mark-key> if for all x, y ∈ X, if (x, y) ∈ R then (y, x) ∈ R.\n\n<mark-important>This means that the relationship is mutual or reciprocal. If the relation holds in one direction, it must hold in the opposite direction as well.</mark-important>\n\nIn formal logic, this is written as: ∀x∀y[(x, y) ∈ R → (y, x) ∈ R].",
      "key_sentence": "A relation R on a set X is symmetric if for all x, y ∈ X if (x, y) ∈ R then (y, x) ∈ R.",
      "simple_explanation": "If a relation is symmetric, it means the relationship is a two-way street. If A is related to B, then B must be related to A.",
      "analogy": "It's like being Facebook friends. If you are friends with someone, they are also friends with you. The connection goes both ways.",
      "why_exists": "To formally describe relationships that are mutual or reciprocal, a common pattern found in social networks ('is friends with'), geometry ('is perpendicular to'), and logic ('is equivalent to').",
      "note": "Two-way street",
      "exam_critical": true,
      "parent": 1,
      "subtitle": "Symmetric Relations"
    },
    {
      "id": 6,
      "type": "example",
      "level": 3,
      "path": "Properties of Relations > Symmetric Relations > Example: Not Symmetric",
      "exam_text": "*The relation R on X={1,2,3,4} where x ≤ y is not symmetric. The pair (1, 2) is in R, but its reverse (2, 1) is not, since 2 is not ≤ 1.*",
      "full_text": "Let the relation R on X={1,2,3,4} be defined by (x, y) ∈ R if and only if x ≤ y.\n\nThis relation is **not symmetric**. To prove this, we only need to find one counter-example. \n\nThe pair (1, 2) is in R because 1 ≤ 2 is true. However, the reverse pair (2, 1) is not in R because 2 ≤ 1 is false. Since we found a pair without its reverse, the relation is not symmetric.",
      "key_sentence": "This relation is not symmetric because (1,2) ∈ R but (2,1) ∉ R.",
      "simple_explanation": "The rule is 'less than or equal to'. 1 is less than 2, so (1,2) is in. But is 2 less than 1? No. Since the reverse pair isn't included, it's not a two-way street, so it's not symmetric.",
      "analogy": "It's like the relationship 'is older than'. If your dad is older than you, are you older than your dad? No. It's a one-way relationship, not a symmetric one.",
      "why_exists": "To show a common and intuitive example of a relation that is directional and therefore fails the symmetry test.",
      "exam_critical": false,
      "parent": 5,
      "subtitle": "Example: Not Symmetric"
    },
    {
      "id": 7,
      "type": "concept",
      "level": 2,
      "path": "Properties of Relations > Antisymmetric Relations",
      "title": "Antisymmetric Relations",
      "exam_text": "A relation R is <mark-key>antisymmetric</mark-key> if for any two different elements x and y, you cannot have both (x, y) and (y, x) in the relation. A two-way street is only allowed if x=y.",
      "full_text": "A relation R on a set X is <mark-key>antisymmetric</mark-key> if for all x, y ∈ X, if (x, y) ∈ R and (y, x) ∈ R, then it must be that x = y.\n\n<mark-important>In other words, a two-way relationship between two **different** elements is forbidden. The only time a reverse pair (y,x) is allowed is for self-relating pairs like (x,x).</mark-important>\n\nAn equivalent definition (the contrapositive) is: if x ≠ y, then (x, y) and (y, x) cannot both be in R.",
      "key_sentence": "A relation R on a set X is antisymmetric if for all x, y ∈ X, if (x, y) ∈ R and (y, x) ∈ R, then x = y.",
      "simple_explanation": "This rule says a relationship can't be a two-way street *unless* it's an element related to itself. If A is related to B, then B cannot be related back to A, unless A and B are the exact same thing.",
      "analogy": "Think of a company's hierarchy chart. If your boss (A) manages you (B), then you (B) cannot also manage your boss (A). The relationship only goes one way for different people.",
      "why_exists": "To define ordering relationships like 'less than or equal to' or 'is a subset of'. These relations must be strictly one-way for distinct elements, and antisymmetry formally captures this idea.",
      "note": "One-way street",
      "exam_critical": true,
      "parent": 1,
      "subtitle": "Antisymmetric Relations"
    },
    {
      "id": 8,
      "type": "example",
      "level": 3,
      "path": "Properties of Relations > Antisymmetric Relations > Example: '≤' is Antisymmetric",
      "exam_text": "*The relation R on X={1,2,3,4} where x ≤ y is antisymmetric. If x ≤ y and y ≤ x, the only way this can be true is if x = y, which satisfies the definition.*",
      "full_text": "Let the relation R on X={1,2,3,4} be defined by (x, y) ∈ R if and only if x ≤ y.\n\nThis relation is **antisymmetric**. According to the definition, we must check if [(x, y) ∈ R and (y, x) ∈ R] implies [x = y].\n\nIn terms of the rule, this means: if (x ≤ y) and (y ≤ x), does that imply x = y? Yes, the only way a number can be both less-than-or-equal-to and greater-than-or-equal-to another number is if they are the same number.",
      "key_sentence": "R is antisymmetric because for all x, y ∈ X if (x, y) ∈ R (i.e. x ≤ y) and (y, x) ∈ R (i.e. y ≤ x) then x = y.",
      "simple_explanation": "The rule is 'less than or equal to'. Can you find two different numbers where the rule works both ways? No. For example, 1 ≤ 2 but 2 is not ≤ 1. The only time it works both ways is for the same number, like 3 ≤ 3. This follows the rule perfectly, so it's antisymmetric.",
      "analogy": "It's like the relationship 'is a biological ancestor of'. If your grandfather is your ancestor, you can't also be his ancestor. The relationship cannot go both ways for two different people.",
      "why_exists": "To show how the common 'less than or equal to' operator is a perfect real-world example of the abstract concept of antisymmetry.",
      "exam_critical": false,
      "parent": 7,
      "subtitle": "Example: '≤' is Antisymmetric"
    },
    {
      "id": 9,
      "type": "concept",
      "level": 2,
      "path": "Properties of Relations > Transitive Relations",
      "title": "Transitive Relations",
      "exam_text": "A relation R is <mark-key>transitive</mark-key> if a path from x to y and from y to z implies a direct 'shortcut' path from x to z. If (x,y) and (y,z) are in R, then (x,z) must be in R.",
      "full_text": "A relation R on a set X is <mark-key>transitive</mark-key> if for all x, y, z ∈ X, if (x, y) ∈ R and (y, z) ∈ R, then (x, z) ∈ R.\n\n<mark-important>This property implies that if you can get from a starting point to an intermediate point, and from that intermediate point to a final point, there must be a direct relation from the start to the finish.</mark-important>\n\nIn formal logic, this is written as: ∀x∀y∀z[((x, y) ∈ R ∧ (y, z) ∈ R) → (x, z) ∈ R].",
      "key_sentence": "A relation R on a set X is transitive if for all x, y, z ∈ X, if (x, y) ∈ R and (y, z) ∈ R, then (x, z) ∈ R.",
      "simple_explanation": "If A is related to B, and B is related to C, then a transitive relation guarantees that A is also related to C. It's like a chain reaction or connecting flights.",
      "analogy": "If you can fly from New York to Chicago, and from Chicago to Los Angeles, then the airline effectively offers a route from New York to Los Angeles. Transitivity is the existence of that direct end-to-end connection.",
      "why_exists": "To model chains of relationships, such as inheritance ('is an ancestor of'), ordering ('is less than'), or logical implication ('if A implies B, and B implies C, then A implies C').",
      "note": "Chain property",
      "exam_critical": true,
      "parent": 1,
      "subtitle": "Transitive Relations"
    },
    {
      "id": 10,
      "type": "example",
      "level": 3,
      "path": "Properties of Relations > Transitive Relations > Example: '≤' is Transitive",
      "exam_text": "*The relation R on X={1,2,3,4} where x ≤ y is transitive. If x ≤ y and y ≤ z, it logically follows that x ≤ z.*",
      "full_text": "Let the relation R on X={1,2,3,4} be defined by (x, y) ∈ R if and only if x ≤ y.\n\nThis relation is **transitive**. For any numbers x, y, and z in the set, if (x, y) ∈ R and (y, z) ∈ R, this means x ≤ y and y ≤ z. By the mathematical property of inequalities, it must be true that x ≤ z. Therefore, (x, z) is also in R.\n\nFor example:\n• (1, 2) ∈ R and (2, 3) ∈ R. We check for (1, 3): 1 ≤ 3 is true, so (1, 3) ∈ R.\n• (1, 3) ∈ R and (3, 4) ∈ R. We check for (1, 4): 1 ≤ 4 is true, so (1, 4) ∈ R.",
      "key_sentence": "If x ≤ y and y ≤ z, by the mathematical property of inequalities, it must be true that x ≤ z.",
      "simple_explanation": "The rule is 'less than or equal to'. If 1 is less than 2, and 2 is less than 4, is 1 less than 4? Yes. This shortcut always works for this rule, so the relation is transitive.",
      "analogy": "It's like a set of Russian nesting dolls. If doll A fits inside doll B, and doll B fits inside doll C, then you know for sure that doll A will fit inside doll C.",
      "why_exists": "To demonstrate with a very common mathematical operator ('≤') how the transitive property works in practice.",
      "exam_critical": false,
      "parent": 9,
      "subtitle": "Example: '≤' is Transitive"
    },
    {
      "id": 11,
      "type": "concept",
      "level": 2,
      "path": "Properties of Relations > Partial Order",
      "title": "Partial Order",
      "exam_text": "A relation is a <mark-critical>partial order</mark-critical> if it is reflexive, antisymmetric, and transitive. The '≤' and 'divides' relations are common examples.",
      "full_text": "A relation R on a set X is called a <mark-critical>partial order</mark-critical> if it satisfies three specific properties simultaneously:\n1. **Reflexive**: Every element is related to itself.\n2. **Antisymmetric**: The relation is a 'one-way street' between different elements.\n3. **Transitive**: The relation supports 'shortcuts' across chains.\n\nA partial order allows for the comparison of some elements, but not necessarily all. For example, in the 'divides' relation, 2 and 3 are incomparable.",
      "key_sentence": "A relation R on a set X is a partial order if R is reflexive, antisymmetric, and transitive.",
      "simple_explanation": "A partial order is a way of organizing things where some items can be compared (like 'less than or equal to'), but others might not be comparable at all. It needs to follow three rules: everything is equal to itself, relationships are one-way streets, and chains can be shortcutted.",
      "analogy": "Think of a software project's task dependencies. Some tasks must be done before others ('task A must precede B'), creating an order. This is reflexive (a task precedes itself), antisymmetric (if A is before B, B can't be before A), and transitive (if A is before B, and B is before C, then A is before C). It's 'partial' because two unrelated tasks, C and D, might be done in any order.",
      "why_exists": "To formalize the idea of ordering and hierarchy. This concept is crucial in computer science for things like task scheduling, data structure organization (trees), and version control.",
      "note": "R + A + T",
      "exam_critical": true,
      "parent": 1,
      "subtitle": "Partial Order"
    },
    {
      "id": 12,
      "type": "concept",
      "level": 3,
      "path": "Properties of Relations > Partial Order > Total Order",
      "title": "Total Order",
      "exam_text": "In a partial order, if every pair of elements can be compared (one is related to the other), the relation is called a <mark-critical>total order</mark-critical>.",
      "full_text": "For a partial order R on a set X:\n\n• Two elements x and y are **comparable** if either (x, y) ∈ R or (y, x) ∈ R.\n• They are **incomparable** if neither relation holds.\n\n<mark-important>If **every** pair of elements in the set X is comparable, the partial order is called a <mark-critical>total order</mark-critical>.</mark-important> This means all elements can be placed in a single, unambiguous line.",
      "key_sentence": "If every pair of elements in X is comparable, we call R a total order.",
      "simple_explanation": "A partial order is 'partial' because you might not be able to compare some things (e.g., you can't say 2 'divides' 3, or 3 'divides' 2). If you have a special partial order where *every single item* can be compared to every other item, it's upgraded to a 'total order'.",
      "analogy": "A 'divides' relation is a partial order: you can't compare 3 and 5. It's like a tournament bracket before the finals; not every team has played every other. A 'total order' is like the final ranking at the end of the season (1st, 2nd, 3rd...). Every team has a clear rank relative to every other team.",
      "why_exists": "To distinguish between partial orderings where some elements are unrelated (like a family tree) and those where all elements can be lined up in a sequence (like numbers on a number line or words in a dictionary).",
      "note": "All elements comparable",
      "exam_critical": true,
      "parent": 11,
      "subtitle": "Total Order"
    },
    {
      "id": 13,
      "type": "concept",
      "level": 2,
      "path": "Properties of Relations > Inverse Relation",
      "title": "Inverse Relation",
      "exam_text": "The <mark-key>inverse</mark-key> of a relation R, denoted R⁻¹, is created by flipping every pair. If (x, y) is in R, then (y, x) is in R⁻¹.",
      "full_text": "Let R be a relation from a set X to a set Y. The <mark-key>inverse of R</mark-key>, denoted R⁻¹, is the relation from Y back to X, defined by flipping the order of every pair in R.\n\nFormally: <mark-critical>R⁻¹ = {(y, x) | (x, y) ∈ R}</mark-critical>.",
      "key_sentence": "The inverse of R, denoted R⁻¹, is the relation from Y to X defined by R⁻¹ = {(y, x)| (x, y) ∈ R}.",
      "simple_explanation": "To get the inverse of a relation, you just take every pair of connected items and swap their positions. If A is related to B in the original, then B is related to A in the inverse.",
      "analogy": "If the original relation is 'is the parent of', the inverse relation is 'is the child of'. If (John, Mary) means John is the parent of Mary, then in the inverse, (Mary, John) means Mary is the child of John.",
      "why_exists": "To formally define the concept of reversing a relationship, which is useful in many areas, such as database queries (finding students for a course vs. finding courses for a student) or reversing a mapping.",
      "note": "Flip the pairs",
      "exam_critical": false,
      "parent": 1,
      "subtitle": "Inverse Relation"
    },
    {
      "id": 14,
      "type": "section",
      "level": 1,
      "path": "Equivalence Relations",
      "title": "Equivalence Relations",
      "exam_text": "An equivalence relation is a relation that groups similar items into disjoint classes. It must be reflexive, symmetric, and transitive.",
      "full_text": "An <mark-key>equivalence relation</mark-key> is a special type of relation that partitions a set into a collection of disjoint subsets, called equivalence classes. Within each subset, all elements are considered 'equivalent' to one another according to the relation's rule.",
      "key_sentence": "An equivalence relation is a special type of relation that partitions a set into a collection of disjoint subsets, called equivalence classes.",
      "simple_explanation": "This is a special type of relationship that acts like an 'equals' sign, grouping things that are similar in some way. For example, 'has the same birthday as' is an equivalence relation that groups people by their birth date.",
      "analogy": "It's like sorting laundry. You put all the socks in one pile, all the shirts in another. Within the sock pile, every sock is 'equivalent' to every other sock (they're all socks). The sorting rule creates groups of equivalent items.",
      "why_exists": "To mathematically formalize the idea of 'sameness' or 'equivalence'. This allows us to group elements of a set into classes where all elements in a class share a common property, simplifying complex sets.",
      "note": "Groups similar items",
      "exam_critical": true,
      "subtitle": "Equivalence Relations"
    },
    {
      "id": 15,
      "type": "concept",
      "level": 2,
      "path": "Equivalence Relations > Definition",
      "title": "Definition of Equivalence Relation",
      "exam_text": "A relation is an <mark-critical>equivalence relation</mark-critical> if it satisfies three properties: it must be reflexive, symmetric, and transitive.",
      "full_text": "A relation R on a set X is called an <mark-critical>equivalence relation</mark-critical> if it satisfies three properties:\n1. **Reflexive**: Every element is related to itself (a~a).\n2. **Symmetric**: If a is related to b, then b is related to a (if a~b, then b~a).\n3. **Transitive**: If a is related to b and b is related to c, then a is related to c (if a~b and b~c, then a~c).\n\nElements related by an equivalence relation are called **equivalent**.",
      "key_sentence": "A relation that is reflexive, symmetric, and transitive on a set X is called an equivalence relation on X.",
      "simple_explanation": "To be an 'equivalence relation', a relationship has to pass three tests: 1. Everyone is equivalent to themselves (reflexive). 2. If you're equivalent to me, I'm equivalent to you (symmetric). 3. If you're equivalent to Bob, and Bob is equivalent to Carol, then you're equivalent to Carol (transitive).",
      "analogy": "Think of the relation 'lives in the same city as'. It's reflexive (you live in the same city as yourself), symmetric (if you live in the same city as a friend, they live in the same city as you), and transitive (if you live in the same city as Bob, and Bob lives in the same city as Carol, then you and Carol live in the same city).",
      "why_exists": "This specific combination of properties (R+S+T) perfectly captures our intuitive notion of what it means for things to be 'the same' in some respect, allowing us to formally group and classify objects.",
      "note": "R + S + T",
      "exam_critical": true,
      "parent": 14,
      "subtitle": "Definition"
    },
    {
      "id": 16,
      "type": "example",
      "level": 3,
      "path": "Equivalence Relations > Definition > Example",
      "exam_text": "*A given relation on {1,2,3,4,5} is proven to be an equivalence relation by verifying it is reflexive, symmetric, and transitive. Since (1,3) is in R, we say 1 and 3 are equivalent (1~3).*",
      "full_text": "Consider the relation R = {(1,1), (1,3), (1,5), (2,2), (2,4), (3,1), (3,3), (3,5), (4,2), (4,4), (5,1), (5,3), (5,5)} on {1,2,3,4,5}.\n\nThis is an equivalence relation because:\n• **Reflexive**: It contains (1,1), (2,2), (3,3), (4,4), (5,5).\n• **Symmetric**: For every pair like (1,3), the reverse (3,1) is present. This holds for all pairs.\n• **Transitive**: For chains like (1,3) and (3,5), the shortcut (1,5) is present. This holds for all chains.\n\nBecause R is an equivalence relation and (1,3) is in R, we can say that 1 is equivalent to 3, written as 1~3.",
      "key_sentence": "Since R is reflexive, symmetric and transitive, R is an equivalence relation on {1,2,3,4,5}.",
      "simple_explanation": "This big list of pairs passes all three tests for equivalence. It has all the (x,x) pairs. All pairs have their reverse. All chains have a shortcut. Therefore, it's a valid equivalence relation, which lets us say that connected numbers like 1 and 3 are 'equivalent' or in the same group.",
      "analogy": "This relation effectively groups numbers into two families: {1, 3, 5} and {2, 4}. Within the {1, 3, 5} family, everyone is related to everyone else (and themselves). The same is true for the {2, 4} family. This setup satisfies all three rules for an equivalence relation.",
      "why_exists": "To provide a concrete, non-trivial example of an equivalence relation and show how to verify the three required properties on an explicit set of pairs.",
      "exam_critical": false,
      "parent": 15,
      "subtitle": "Example"
    }
  ]
}