{
  "title": "Fundamentals of Mathematics: Sets",
  "topic": "Information Systems",
  "content": [
    {
      "id": 1,
      "type": "section",
      "level": 1,
      "path": "Sets",
      "title": "Introduction to Sets",
      "exam_text": "A set is a foundational mathematical concept representing an unordered collection of unique objects, known as elements.",
      "full_text": "A set is an unordered collection of distinct objects, which are called elements or members of the set. The main characteristics are that the order of elements does not matter, and duplicate elements are ignored. Sets are a fundamental building block in mathematics.",
      "key_sentence": "A set is an unordered collection of distinct objects, which are called elements or members of the set.",
      "simple_explanation": "A set is basically just a bag of unique things. It doesn't matter what order you put them in, and you can't have the same thing in the bag twice. It's just a way to group stuff together.",
      "analogy": "A set is like your group of friends. It doesn't matter in what order you list their names; it's still the same group. Each friend is an 'element' of the set.",
      "why_exists": "To create a simple, formal way to group related items together. By ignoring order and duplicates, mathematicians can focus on the core question of whether an item belongs to a group or not.",
      "note": "Core Concept",
      "exam_critical": true,
      "subtitle": "Sets"
    },
    {
      "id": 2,
      "type": "concept",
      "level": 2,
      "path": "Sets > Definition",
      "title": "Set Membership",
      "exam_text": "A <mark-key>set</mark-key> is an unordered collection of objects called <mark-key>elements</mark-key>. The notation `a ∈ A` means 'a is an element of A', while `a ∉ A` means it is not.",
      "full_text": "A set is an unordered collection of objects, called **elements** or **members**.\n\n• We use the notation <mark-critical>a ∈ A</mark-critical> to denote that *a* is an element of the set *A*.\n• We use the notation <mark-critical>a ∉ A</mark-critical> to denote that *a* is not an element of the set *A*.\n\n<mark-important>A set is said to *contain* its elements.</mark-important>",
      "key_sentence": "A set is said to contain its elements.",
      "simple_explanation": "A set is a collection of things, and those things are called elements. The symbol '∈' is just a shorthand way of saying something is 'in' the set.",
      "analogy": "If your Spotify playlist is a 'set', each song is an 'element'. So, 'Bohemian Rhapsody ∈ My Playlist' means that song is on your list.",
      "why_exists": "To establish a clear and universal notation for stating whether an object belongs to a particular collection, which is the most fundamental question in set theory.",
      "note": "Basic Notation",
      "exam_critical": true,
      "parent": 1,
      "subtitle": "Definition"
    },
    {
      "id": 3,
      "type": "concept",
      "level": 2,
      "path": "Sets > Roster Method",
      "title": "Roster Method",
      "exam_text": "The <mark-key>roster method</mark-key> describes a set by explicitly listing all its elements between braces, such as `{a, e, i, o, u}`.",
      "full_text": "<mark-important>The roster method is a way to describe a set by listing all of its members between braces { }.</mark-important> This method is best for finite sets where the elements are easy to list.\n\n**Examples:**\n• The set *V* of vowels: `V = {a, e, i, o, u}`\n• The set *O* of odd positive integers less than 10: `O = {1, 3, 5, 7, 9}`\n• For larger sets, an ellipsis can be used: `{1, 2, 3, ..., 99}`",
      "key_sentence": "The roster method is a way to describe a set by listing all of its members between braces { }.",
      "simple_explanation": "The roster method is like writing down a guest list for a party. You just list every single person (or thing) that's included inside curly brackets.",
      "analogy": "It's like the ingredients list for a recipe: `{flour, sugar, eggs}`. You're just listing everything that goes into it, one by one.",
      "why_exists": "To provide a simple, direct, and unambiguous way to define small sets where all elements can be easily written out.",
      "note": "Listing members",
      "exam_critical": false,
      "parent": 1,
      "subtitle": "Roster Method"
    },
    {
      "id": 4,
      "type": "concept",
      "level": 2,
      "path": "Sets > Set Builder Notation",
      "title": "Set Builder Notation",
      "exam_text": "<mark-critical>Set builder notation</mark-critical> describes a set by stating a rule or property its elements must satisfy, like `{x | x is an odd integer < 10}`.",
      "full_text": "<mark-important>Set builder notation describes a set by stating the property or properties its elements must have to be members.</mark-important> This is essential for infinite sets or very large sets where listing elements is impractical.\n\n**Format:** `{ variable | rule(s) for the variable }`\n\n**Examples:**\n• `O = {x | x is an odd positive integer less than 10}`\n• `O = {x ∈ Z⁺ | x is odd and x < 10}` (specifying the universe of positive integers Z⁺)\n• `Q⁺ = {x ∈ R | x = p/q, for some positive integers p and q}` (the set of positive rational numbers)",
      "key_sentence": "Set builder notation describes a set by stating the property or properties its elements must have to be members.",
      "simple_explanation": "Instead of listing every single member of a club, you just write the rule for joining. For example, `{x | x is a student at this school}` is easier than listing thousands of names.",
      "analogy": "It's like a bouncer at a club with a rule: 'You can enter if you are over 21'. The bouncer doesn't need a list of every person's name, just the rule. That rule is the set builder notation.",
      "why_exists": "The roster method is impossible for infinite sets (like all even numbers). Set builder notation provides a concise and powerful way to define these sets by their shared properties.",
      "note": "Defining by rule",
      "exam_critical": true,
      "parent": 1,
      "subtitle": "Set Builder Notation"
    },
    {
      "id": 5,
      "type": "list",
      "level": 2,
      "path": "Sets > Common Number Sets",
      "title": "Common Sets in Mathematics",
      "exam_text": "Standard mathematical sets include Natural numbers (N), Integers (Z), Positive Integers (Z⁺), Rational numbers (Q), and Real numbers (R).",
      "full_text": "Several sets, denoted by boldface letters, are fundamental in mathematics and have standard definitions:",
      "key_sentence": "Several sets, denoted by boldface letters, are fundamental in mathematics and have standard definitions:",
      "simple_explanation": "These are the most famous groups of numbers that mathematicians use all the time. Each one has its own special symbol so everyone knows which group they're talking about.",
      "analogy": "Like categories on Netflix. 'N' is for kid-friendly shows (0, 1, 2...), 'Z' adds the dark and moody shows (negatives), 'Q' adds the indie films (fractions), and 'R' is the entire library (all numbers).",
      "why_exists": "To create a universal shorthand for the most frequently used collections of numbers, so mathematicians and scientists can communicate efficiently without redefining them every time.",
      "items": [
        "EXAM: N (Natural Numbers) | FULL: **N** = {0, 1, 2, 3, ...}, the set of <mark-key>natural numbers</mark-key>.",
        "EXAM: Z (Integers) | FULL: **Z** = {..., -2, -1, 0, 1, 2, ...}, the set of <mark-key>integers</mark-key>.",
        "EXAM: Z⁺ (Positive Integers) | FULL: **Z⁺** = {1, 2, 3, ...}, the set of <mark-key>positive integers</mark-key>.",
        "EXAM: Q (Rational Numbers) | FULL: **Q** = {p/q | p ∈ Z, q ∈ Z, and q ≠ 0}, the set of <mark-key>rational numbers</mark-key> (fractions).",
        "EXAM: R (Real Numbers) | FULL: **R**, the set of <mark-key>real numbers</mark-key> (all numbers on the number line).",
        "EXAM: R⁺ (Positive Real Numbers) | FULL: **R⁺**, the set of <mark-key>positive real numbers</mark-key>.",
        "EXAM: C (Complex Numbers) | FULL: **C**, the set of <mark-key>complex numbers</mark-key>."
      ],
      "note": "Must memorize",
      "exam_critical": true,
      "parent": 1,
      "subtitle": "Common Number Sets"
    },
    {
      "id": 6,
      "type": "concept",
      "level": 3,
      "path": "Sets > Common Number Sets > Intervals",
      "title": "Interval Notation",
      "exam_text": "An interval is a set of real numbers. A <mark-key>closed interval</mark-key> `[a, b]` includes its endpoints (a ≤ x ≤ b), while an <mark-key>open interval</mark-key> `(a, b)` excludes them (a < x < b).",
      "full_text": "Interval notation is a shorthand for writing sets of real numbers between two endpoints, *a* and *b*.\n\n• **Closed Interval** `[a, b] = {x | a ≤ x ≤ b}` (endpoints are included)\n• **Open Interval** `(a, b) = {x | a < x < b}` (endpoints are excluded)\n• **Half-Open Intervals**: `[a, b)` or `(a, b]` include one endpoint but not the other.\n\n<mark-important>Square brackets `[]` mean the endpoint is included; parentheses `()` mean it is excluded.</mark-important>",
      "key_sentence": "Square brackets `[]` mean the endpoint is included; parentheses `()` mean it is excluded.",
      "simple_explanation": "Intervals are just a slice of the number line. A square bracket `[` is like a closed door, keeping that end number in. A parenthesis `(` is like an open door, letting that number out.",
      "analogy": "A movie showing time `[2:00, 4:00]` means the movie runs from exactly 2:00 to 4:00. An age range for a 'teenager' might be `[13, 19]`. An 'adult' swim time of `(12:00, 1:00)` means you can't swim at exactly 12:00 or 1:00, but any time in between.",
      "why_exists": "To provide a compact and clear way to represent continuous ranges of numbers without having to write out full inequalities every time.",
      "note": "Range notation",
      "exam_critical": true,
      "parent": 5,
      "subtitle": "Intervals"
    },
    {
      "id": 7,
      "type": "concept",
      "level": 2,
      "path": "Sets > Set Equality",
      "title": "Set Equality",
      "exam_text": "Two sets are <mark-key>equal</mark-key> if and only if they have the exact same elements. Order and repetition of elements do not matter.",
      "full_text": "<mark-important>Two sets are equal if and only if they have the same elements.</mark-important> This means that for sets *A* and *B*, `A = B` if and only if `∀x(x ∈ A ↔ x ∈ B)`.\n\n**Key Properties:**\n• **Order doesn't matter:** The set `{1, 3, 5}` is equal to `{3, 5, 1}`.\n• **Repetition doesn't matter:** The set `{1, 3, 3, 5, 5, 5}` is equal to `{1, 3, 5}`.",
      "key_sentence": "Two sets are equal if and only if they have the same elements.",
      "simple_explanation": "Two sets are considered the same if they contain the exact same members. It's like having two bags with the same three toys in them—it doesn't matter how they're arranged or if you list a toy twice on the label.",
      "analogy": "The set of ingredients for a cake, `{flour, sugar, eggs}`, is the same set regardless of the order you list them. Listing 'sugar' twice doesn't change the fact that sugar is an ingredient.",
      "why_exists": "To formally define what it means for two collections to be identical, focusing only on membership and ignoring superficial differences like ordering or duplication.",
      "note": "Order/reps irrelevant",
      "exam_critical": true,
      "parent": 1,
      "subtitle": "Set Equality"
    },
    {
      "id": 8,
      "type": "section",
      "level": 1,
      "path": "Subsets",
      "title": "Subsets",
      "exam_text": "A set A is a <mark-key>subset</mark-key> of set B (A ⊆ B) if and only if every element of A is also an element of B.",
      "full_text": "The concept of a subset describes a containment relationship between two sets. <mark-important>Set A is a subset of set B if and only if every element of A is also an element of B.</mark-important> This relationship is denoted by the notation `A ⊆ B`.",
      "key_sentence": "Set A is a subset of set B if and only if every element of A is also an element of B.",
      "simple_explanation": "If you have a box of crayons (Set B), and you take out just the blue crayons (Set A), then your group of blue crayons is a 'subset' of all the crayons.",
      "analogy": "The set of all 'Golden Retrievers' is a subset of the larger set of all 'Dogs', because every Golden Retriever is also a Dog.",
      "why_exists": "To formally describe the relationship where one set is entirely contained within another, which is a fundamental concept for comparing, classifying, and structuring sets.",
      "note": "Set Containment",
      "exam_critical": true,
      "subtitle": "Subsets"
    },
    {
      "id": 9,
      "type": "list",
      "level": 2,
      "path": "Subsets > Proof Methods",
      "title": "Proving Subset Relationships",
      "exam_text": "To prove A ⊆ B, show that any element in A must also be in B. To disprove it (A ⊄ B), find one element in A that is not in B.",
      "full_text": "There are standard logical methods for proving or disproving a subset relationship:",
      "key_sentence": "To show that A ⊆ B, show that if x belongs to A then x also belongs to B.",
      "simple_explanation": "To prove that all your friends are from Texas, you have to show that every single friend is from Texas. To prove that's *false*, you only need to find one friend who is from Oklahoma.",
      "analogy": "To prove all your apps are free, you have to check every app's price. To disprove it, you just need to find one app that you paid for (a counterexample).",
      "why_exists": "To establish clear, logical steps for formally verifying or refuting claims about set containment, which is a core activity in mathematical proofs.",
      "items": [
        "EXAM: Proving A ⊆ B | FULL: **To show A is a Subset of B:** Show that for any arbitrarily chosen element *x*, if *x* ∈ *A*, then it must follow that *x* ∈ *B*.",
        "EXAM: Proving A ⊄ B | FULL: **To show A is Not a Subset of B:** Find a single element *x* (a counterexample) such that *x* ∈ *A* but *x* ∉ *B*."
      ],
      "note": "Proof strategy",
      "exam_critical": false,
      "parent": 8,
      "subtitle": "Proof Methods"
    },
    {
      "id": 10,
      "type": "concept",
      "level": 2,
      "path": "Subsets > Fundamental Theorems",
      "title": "Fundamental Subset Theorems",
      "exam_text": "For any set S, the empty set (∅) and S itself are always subsets. To prove two sets A and B are equal, one must show that A ⊆ B and B ⊆ A.",
      "full_text": "There are several key theorems and proof techniques related to subsets:\n\n1.  **Guaranteed Subsets:** For any set S:\n    • The <mark-key>empty set</mark-key> is a subset of every set: `∅ ⊆ S`.\n    • Every set is a subset of itself: `S ⊆ S`.\n\n2.  **Proving Set Equality:** <mark-important>To show that two sets *A* and *B* are equal, you must show that `A ⊆ B` and `B ⊆ A`.</mark-important> This is a common and powerful proof technique.",
      "key_sentence": "To show that two sets A and B are equal, you must show that A ⊆ B and B ⊆ A.",
      "simple_explanation": "Every group of people includes the 'group of nobody' (the empty set) and the entire group itself as subgroups. Also, if two groups have the exact same members, it means everyone from group A is in group B, AND everyone from group B is in group A.",
      "analogy": "A deck of cards always contains a subset of 'no cards' (∅) and a subset of 'all the cards' (S). To prove two decks are identical, you show that every card from deck 1 is in deck 2, and vice-versa.",
      "why_exists": "To establish foundational rules about subsets that are always true and to provide a rigorous, step-by-step method for proving that two distinct-looking sets are actually identical.",
      "note": "Key Proof Technique",
      "exam_critical": true,
      "parent": 8,
      "subtitle": "Fundamental Theorems"
    },
    {
      "id": 11,
      "type": "concept",
      "level": 2,
      "path": "Sets > Cardinality",
      "title": "The Size of a Set (Cardinality)",
      "exam_text": "The <mark-key>cardinality</mark-key> of a finite set S, denoted `|S|`, is the number of distinct elements in the set. For A={1,3,5}, |A|=3.",
      "full_text": "If a set *S* has exactly *n* distinct elements, where *n* is a nonnegative integer, we say *S* is a <mark-key>finite set</mark-key>.\n\n<mark-important>The cardinality of *S*, denoted by `|S|`, is the number of distinct elements in the set *S*.</mark-important>\n\n**Examples:**\n• If A = {1, 3, 5, 7, 9}, then `|A| = 5`.\n• If S is the set of letters in the English alphabet, then `|S| = 26`.\n• The cardinality of the null set is zero: `|∅| = 0`.",
      "key_sentence": "The cardinality of S, denoted by |S|, is the number of distinct elements in the set S.",
      "simple_explanation": "Cardinality is just a fancy word for 'how many things are in the set?'. It's like taking attendance and counting how many people are in the room.",
      "analogy": "If your set is your hand of playing cards, the cardinality is simply the number of cards you're holding. A hand with 5 cards has a cardinality of 5.",
      "why_exists": "To create a formal mathematical way to measure and compare the 'size' of different sets.",
      "note": "Counting Elements",
      "exam_critical": true,
      "parent": 1,
      "subtitle": "Cardinality"
    },
    {
      "id": 12,
      "type": "concept",
      "level": 2,
      "path": "Sets > Power Set",
      "title": "Power Set",
      "exam_text": "The <mark-critical>power set</mark-critical> of a set S, denoted P(S), is the set of all possible subsets of S, including the empty set and S itself.",
      "full_text": "<mark-important>Given a set S, the power set of S, denoted P(S), is the set of all subsets of S.</mark-important>\n\n**Example:**\nIf S = {0, 1, 2}, its subsets are:\n• `∅` (the empty set)\n• `{0}`, `{1}`, `{2}` (subsets of size 1)\n• `{0, 1}`, `{0, 2}`, `{1, 2}` (subsets of size 2)\n• `{0, 1, 2}` (the set itself)\n\nTherefore, the power set is `P({0, 1, 2}) = {∅, {0}, {1}, {2}, {0, 1}, {0, 2}, {1, 2}, {0, 1, 2}}`.",
      "key_sentence": "Given a set S, the power set of S, denoted P(S), is the set of all subsets of S.",
      "simple_explanation": "If a set is the pizza toppings you have, like {pepperoni, mushrooms}, the power set is every single different pizza you could possibly make: plain, pepperoni-only, mushroom-only, and a pepperoni-mushroom pizza.",
      "analogy": "Imagine a team of 3 people: {A, B, C}. The power set is every possible committee you could form: the empty committee (nobody), single-person committees ({A}, {B}, {C}), two-person committees ({A,B}, {A,C}, {B,C}), and the full committee ({A,B,C}).",
      "why_exists": "To create a 'set of sets' that represents every possible combination or grouping of elements from an original set, which is crucial in areas like combinatorics, probability, and computer science.",
      "note": "Set of all subsets",
      "exam_critical": true,
      "parent": 1,
      "subtitle": "Power Set"
    },
    {
      "id": 13,
      "type": "section",
      "level": 1,
      "path": "Cartesian Products",
      "title": "Cartesian Products",
      "exam_text": "A <mark-key>Cartesian Product</mark-key> combines elements from two or more sets into ordered pairs or tuples, where order matters. This is different from a set, which is unordered.",
      "full_text": "Because sets are inherently unordered, a different structure is needed to represent collections where the order of elements is important. <mark-important>This structure is the ordered n-tuple, and it is created by the Cartesian product operation.</mark-important>",
      "key_sentence": "This structure is the ordered n-tuple, and it is created by the Cartesian product operation.",
      "simple_explanation": "A Cartesian product is a way to find every possible pairing of items from different groups. It's like matching every shirt you own with every pair of pants to see all possible outfits.",
      "analogy": "Think of a restaurant menu with a 'Choose 1 Main, 1 Side' deal. The Cartesian product is the complete list of every single possible meal combination, like {Steak, Fries}, {Steak, Salad}, {Chicken, Fries}, {Chicken, Salad}.",
      "why_exists": "To create a mathematical structure for ordered pairings, which is the foundation for defining coordinates in geometry, relations in databases, and functions in algebra.",
      "note": "Ordered Pairings",
      "exam_critical": true,
      "subtitle": "Cartesian Products"
    },
    {
      "id": 14,
      "type": "concept",
      "level": 2,
      "path": "Cartesian Products > Ordered n-tuple",
      "title": "Ordered n-tuple",
      "exam_text": "An <mark-key>ordered n-tuple</mark-key> `(a₁, a₂, ..., aₙ)` is an ordered collection where position is critical. For ordered pairs, `(a, b)` is not equal to `(b, a)` unless a=b.",
      "full_text": "An <mark-important>ordered n-tuple (a₁, a₂, ..., aₙ) is an ordered collection of elements where a₁ is the first element, a₂ is the second, and so on.</mark-important>\n\n**Equality:** Two n-tuples are equal if and only if their corresponding elements are equal. `(a₁, ..., aₙ) = (b₁, ..., bₙ)` if and only if `aᵢ = bᵢ` for all *i*.\n\n**Ordered Pair:** An ordered 2-tuple `(a, b)` is called an ordered pair. Crucially, `(a, b) ≠ (b, a)` unless `a = b`.",
      "key_sentence": "An ordered n-tuple (a₁, a₂, ..., aₙ) is an ordered collection of elements where a₁ is the first element, a₂ is the second, and so on.",
      "simple_explanation": "An ordered tuple is like a password or a locker combination. The order of the numbers or letters matters intensely. '1-2-3' is completely different from '3-2-1'.",
      "analogy": "It's like coordinates on a map (x, y). The point (3, 5) is a different location from (5, 3). The order is critical.",
      "why_exists": "To represent collections where the position of each element has a specific meaning (like x and y coordinates), which standard sets (being unordered) cannot do.",
      "note": "Order matters!",
      "exam_critical": true,
      "parent": 13,
      "subtitle": "Ordered n-tuple"
    },
    {
      "id": 15,
      "type": "formula",
      "level": 2,
      "path": "Cartesian Products > Definition",
      "title": "Cartesian Product Definition",
      "exam_text": "The Cartesian Product of A and B is `A × B = {(a, b) | a ∈ A ∧ b ∈ B}`. It is the set containing all possible ordered pairs from A and B.",
      "full_text": "Let A and B be sets. The <mark-key>Cartesian product</mark-key> of A and B, denoted by A × B, is the set of all ordered pairs (a, b), where a is an element of A and b is an element of B.\n\n<mark-critical>A × B = {(a, b) | a ∈ A ∧ b ∈ B}</mark-critical>",
      "key_sentence": "The Cartesian product of A and B, denoted by A × B, is the set of all ordered pairs (a, b), where a is an element of A and b is an element of B.",
      "simple_explanation": "The formula for A × B just means 'create a new set that contains every possible pair you can make, where the first item in the pair comes from set A and the second item comes from set B'.",
      "analogy": "If Set A = {King, Queen} and Set B = {Spades, Hearts}, then A × B is {(King, Spades), (King, Hearts), (Queen, Spades), (Queen, Hearts)}—all possible unique pairings.",
      "why_exists": "To provide a formal mathematical definition for the operation of creating a comprehensive set of all possible ordered pairs between two source sets.",
      "note": "Formal definition",
      "exam_critical": true,
      "parent": 13,
      "subtitle": "Definition"
    },
    {
      "id": 16,
      "type": "concept",
      "level": 3,
      "path": "Cartesian Products > Definition > Commutativity",
      "title": "Non-Commutativity of Cartesian Product",
      "exam_text": "The Cartesian product is not commutative, meaning `A × B ≠ B × A` in most cases. The order of the sets in the operation matters.",
      "full_text": "The order of sets in a Cartesian product operation is critical. In general, the product is not commutative.\n\nLet A = {1, 2} and B = {a, b, c}.\n• `A × B = {(1, a), (1, b), (1, c), (2, a), (2, b), (2, c)}`\n• `B × A = {(a, 1), (a, 2), (b, 1), (b, 2), (c, 1), (c, 2)}`\n\n<mark-important>The sets A × B and B × A are not equal, unless A = B or one of the sets is empty (∅).</mark-important>",
      "key_sentence": "The sets A × B and B × A are not equal, unless A = B or one of the sets is empty (∅).",
      "simple_explanation": "Matching shirts with pants gives you a different set of outfits than matching pants with shirts. Because the order in the pair matters, switching the sets gives you a different result.",
      "analogy": "A flight from New York (A) to London (B) is not the same as a flight from London (B) to New York (A). The ordered pair (NY, London) represents a different journey than (London, NY).",
      "why_exists": "To highlight a crucial property that distinguishes the Cartesian product from operations like addition or multiplication of numbers, where order does not change the result.",
      "note": "A × B ≠ B × A",
      "exam_critical": false,
      "parent": 15,
      "subtitle": "Commutativity"
    },
    {
      "id": 17,
      "type": "concept",
      "level": 2,
      "path": "Cartesian Products > Relations",
      "title": "Relations",
      "exam_text": "A <mark-key>relation</mark-key> from set A to set B is any subset of the Cartesian product A × B. It represents a specific connection between elements.",
      "full_text": "<mark-important>A subset R of the Cartesian product A × B is called a relation from set A to set B.</mark-important> The elements of R are ordered pairs that represent a specific relationship.\n\n• The first element of each pair belongs to A, and the second belongs to B.\n• A relation from a set A to itself (a subset of A x A) is called a relation on A.\n\n**Example:**\nIf A = {students} and B = {courses}, A × B is all possible student-course pairings. The relation R could be the set of *actual enrollments*, which is a subset of A × B.",
      "key_sentence": "A subset R of the Cartesian product A × B is called a relation from set A to set B.",
      "simple_explanation": "If the Cartesian product is every possible student-and-class pairing at a school, a 'relation' is the actual enrollment list—just a specific subset of all those possibilities.",
      "analogy": "The Cartesian product of all people and all phone numbers is every person paired with every possible number. A 'relation' is the actual phone book—a specific subset where each person is paired with *their own* phone number.",
      "why_exists": "To formally model real-world relationships. The Cartesian product gives all *potential* pairings, and a relation specifies which of those pairings actually *exist* according to some rule or observation.",
      "note": "Subset of A × B",
      "exam_critical": true,
      "parent": 13,
      "subtitle": "Relations"
    },
    {
      "id": 18,
      "type": "section",
      "level": 1,
      "path": "Set Operations",
      "title": "Set Operations",
      "exam_text": "Core set operations combine sets to create new ones. Key operations are Union (∪), Intersection (∩), Difference (-), and Complement (Ā).",
      "full_text": "Set operations are ways to combine or modify sets to create new sets, much like arithmetic operations (+, -, ×, ÷) work on numbers. The fundamental operations are Union, Intersection, Difference, and Complement, which form the basis of set algebra.",
      "key_sentence": "Set operations are ways to combine or modify sets to create new sets, much like arithmetic operations (+, -, ×, ÷) work on numbers.",
      "simple_explanation": "These are the tools you use to mix and match sets. They let you do things like 'combine these two groups,' 'find out what these two groups have in common,' or 'find who is in this group but not that one'.",
      "analogy": "Think of Venn diagrams. You can merge the circles (union), find their overlapping area (intersection), or look at the part of one circle that doesn't overlap with the other (difference).",
      "why_exists": "To provide a formal algebra for manipulating sets. This allows for the construction of complex sets from simpler ones and for expressing logical relationships between different groups.",
      "note": "Set Algebra",
      "exam_critical": true,
      "subtitle": "Set Operations"
    },
    {
      "id": 19,
      "type": "concept",
      "level": 2,
      "path": "Set Operations > Union",
      "title": "Union (∪)",
      "exam_text": "The <mark-key>union</mark-key> of sets A and B (A ∪ B) is the set containing all elements that are in A, or in B, or in both. It merges the sets.",
      "full_text": "The union of sets A and B, denoted by `A ∪ B`, is the set that contains all elements that are in either A or in B, or in both. Duplicates are counted only once.\n\n<mark-critical>A ∪ B = {x | x ∈ A ∨ x ∈ B}</mark-critical>\n\n**Example:**\n`{1, 3, 5} ∪ {1, 2, 3} = {1, 2, 3, 5}`",
      "key_sentence": "The union of sets A and B, denoted by A ∪ B, is the set that contains all elements that are in either A or in B, or in both.",
      "simple_explanation": "The union is like merging two people's contact lists. The new, combined list has everyone from both original lists, with no duplicate entries.",
      "analogy": "If set A is people who like Marvel movies and set B is people who like DC movies, the union A ∪ B is everyone who likes at least one of those two types of movies.",
      "why_exists": "To define the fundamental operation of combining two sets into a single, larger set that encompasses all members of both original sets.",
      "note": "Combining sets",
      "exam_critical": true,
      "parent": 18,
      "subtitle": "Union"
    },
    {
      "id": 20,
      "type": "concept",
      "level": 2,
      "path": "Set Operations > Intersection",
      "title": "Intersection (∩)",
      "exam_text": "The <mark-key>intersection</mark-key> of A and B (A ∩ B) is the set of elements that exist in *both* A and B. It finds the common ground.",
      "full_text": "The intersection of sets A and B, denoted by `A ∩ B`, is the set containing only those elements that are in both A and B simultaneously.\n\n<mark-critical>A ∩ B = {x | x ∈ A ∧ x ∈ B}</mark-critical>\n\n**Example:**\n`{1, 3, 5} ∩ {1, 2, 3} = {1, 3}`",
      "key_sentence": "The intersection of sets A and B, denoted by A ∩ B, is the set containing only those elements that are in both A and B simultaneously.",
      "simple_explanation": "The intersection is what two groups have in common. If you and a friend compare your favorite bands, the intersection is the set of bands you both like.",
      "analogy": "If set A is people who play soccer and set B is people who play basketball, the intersection A ∩ B is the group of people who are on both the soccer team and the basketball team.",
      "why_exists": "To define the fundamental operation of finding the common elements that are shared between two or more sets.",
      "note": "Finding overlap",
      "exam_critical": true,
      "parent": 18,
      "subtitle": "Intersection"
    },
    {
      "id": 21,
      "type": "concept",
      "level": 3,
      "path": "Set Operations > Intersection > Disjoint Sets",
      "title": "Disjoint Sets",
      "exam_text": "Two sets are <mark-key>disjoint</mark-key> if their intersection is the empty set (A ∩ B = ∅), meaning they share no common elements.",
      "full_text": "<mark-important>Two sets are called disjoint if their intersection is the empty set.</mark-important> This means they have no members in common; they are mutually exclusive.\n\n**Example:**\nLet A = {1, 3, 5, 7, 9} (odd numbers) and B = {2, 4, 6, 8, 10} (even numbers). Because `A ∩ B = ∅`, the sets A and B are disjoint.",
      "key_sentence": "Two sets are called disjoint if their intersection is the empty set.",
      "simple_explanation": "Disjoint sets are two groups with zero overlap. For example, the set of cats and the set of dogs are disjoint.",
      "analogy": "The set of people who live in Canada and the set of people who live in Australia are disjoint. There is no one who lives in both countries at the same time, so the overlap is empty.",
      "why_exists": "To formally describe the specific case where two sets are mutually exclusive, which is a critical property in probability, logic, and data partitioning.",
      "note": "No common elements",
      "exam_critical": false,
      "parent": 20,
      "subtitle": "Disjoint Sets"
    },
    {
      "id": 22,
      "type": "concept",
      "level": 2,
      "path": "Set Operations > Difference",
      "title": "Difference (-)",
      "exam_text": "The <mark-key>difference</mark-key> of A and B (A - B) is the set of elements that are in A but *not* in B. It is equivalent to 'A with B's elements removed'.",
      "full_text": "The difference of sets A and B, denoted by `A - B` (or `A\\B`), is the set containing elements that are in set A but not in set B.\n\n<mark-critical>A - B = {x | x ∈ A ∧ x ∉ B}</mark-critical>\n\n**Note:** This operation is not commutative (`A - B ≠ B - A`).\n**Example:**\n• `{1, 3, 5} - {1, 2, 3} = {5}`\n• `{1, 2, 3} - {1, 3, 5} = {2}`",
      "key_sentence": "The difference of sets A and B, denoted by A - B, is the set containing elements that are in set A but not in set B.",
      "simple_explanation": "A - B means 'start with everything in group A, then take away anything that is also in group B'. If A is your list of chores and B is the chores your sibling did, A - B is the chores you still have left to do.",
      "analogy": "You have a full deck of cards (Set A). You remove all the red cards (Set B). What's left (A - B) is the set of all black cards.",
      "why_exists": "To define the operation of removing elements of one set from another, which is essential for filtering data, isolating unique elements, and expressing logical conditions.",
      "note": "Subtraction for sets",
      "exam_critical": true,
      "parent": 18,
      "subtitle": "Difference"
    },
    {
      "id": 23,
      "type": "concept",
      "level": 2,
      "path": "Set Operations > Complement",
      "title": "Complement (Ā)",
      "exam_text": "The <mark-key>complement</mark-key> of a set A (Ā), is everything in the universal set U that is *not* in A. It is defined as `U - A`.",
      "full_text": "Let U be the <mark-key>universal set</mark-key> (the set of all possible elements being considered).\n\nThe complement of a set A, denoted by `Ā`, is the set of all elements in U that are not in A. <mark-important>Therefore, the complement of A is simply the difference `U - A`.</mark-important>\n\n<mark-critical>Ā = {x ∈ U | x ∉ A}</mark-critical>\n\n**Example:**\nIf U = {all letters of the alphabet} and A = {a, e, i, o, u}, then `Ā` = {b, c, d, f, ...} (the set of consonants).",
      "key_sentence": "The complement of a set A, denoted by Ā, is the set of all elements in U that are not in A.",
      "simple_explanation": "The complement of A is just 'everything that's NOT A'. If the universe is all students in a school and set A is the students on the basketball team, the complement of A is everyone who is not on the team.",
      "analogy": "If the universe (U) is a full deck of cards and set A is all the heart cards, then the complement (Ā) is the set of all spade, club, and diamond cards combined.",
      "why_exists": "To formally define the concept of 'everything else' or 'not in this set' relative to a larger context (the universal set), which is crucial for logical negation.",
      "note": "Everything else",
      "exam_critical": true,
      "parent": 18,
      "subtitle": "Complement"
    },
    {
      "id": 24,
      "type": "list",
      "level": 2,
      "path": "Set Operations > Set Identities",
      "title": "Set Identities",
      "exam_text": "Set identities are algebraic rules for manipulating sets, such as the Commutative, Associative, Distributive, and De Morgan's laws.",
      "full_text": "Set identities are equations involving sets that are true for all possible sets. They are used to simplify and manipulate set expressions, similar to rules in algebra.",
      "key_sentence": "Set identities are equations involving sets that are true for all possible sets.",
      "simple_explanation": "These are like the rules of algebra, but for sets. They let you rearrange and simplify complicated expressions, just like you would with `x` and `y` in math class.",
      "analogy": "Like grammar rules for sentences. You know that 'not (A and B)' means the same as '(not A) or (not B)'. Set identities, especially De Morgan's laws, are the mathematical version of these logical equivalences.",
      "why_exists": "To create a formal system of algebraic manipulation for set theory, allowing for rigorous proofs, simplification of complex logical statements, and optimization in computer science.",
      "items": [
        "EXAM: Identity Laws | FULL: **Identity Laws:** `A ∪ ∅ = A`, `A ∩ U = A`",
        "EXAM: Domination Laws | FULL: **Domination Laws:** `A ∪ U = U`, `A ∩ ∅ = ∅`",
        "EXAM: Idempotent Laws | FULL: **Idempotent Laws:** `A ∪ A = A`, `A ∩ A = A`",
        "EXAM: Complementation Law | FULL: **Complementation Law:** `(Ā) = A`",
        "EXAM: Commutative Laws | FULL: **Commutative Laws:** `A ∪ B = B ∪ A`, `A ∩ B = B ∩ A`",
        "EXAM: Associative Laws | FULL: **Associative Laws:** `A ∪ (B ∪ C) = (A ∪ B) ∪ C`, `A ∩ (B ∩ C) = (A ∩ B) ∩ C`",
        "EXAM: Distributive Laws | FULL: **Distributive Laws:** `A ∪ (B ∩ C) = (A ∪ B) ∩ (A ∪ C)`",
        "EXAM: De Morgan's Laws | FULL: **<mark-critical>De Morgan's Laws:</mark-critical>** Complement of `(A ∩ B)` is `Ā ∪ B̄`; Complement of `(A ∪ B)` is `Ā ∩ B̄`",
        "EXAM: Absorption Laws | FULL: **Absorption Laws:** `A ∪ (A ∩ B) = A`, `A ∩ (A ∪ B) = A`",
        "EXAM: Complement Laws | FULL: **Complement Laws:** `A ∪ Ā = U`, `A ∩ Ā = ∅`"
      ],
      "note": "Key Formulas",
      "exam_critical": true,
      "parent": 18,
      "subtitle": "Set Identities"
    },
    {
      "id": 25,
      "type": "concept",
      "level": 2,
      "path": "Set Operations > Generalized Operations",
      "title": "Generalized Unions and Intersections",
      "exam_text": "Generalized union (∪ᵢ Aᵢ) contains elements in at least one set in a collection. Generalized intersection (∩ᵢ Aᵢ) contains elements present in all sets in a collection.",
      "full_text": "<mark-important>Generalized unions and intersections extend the basic operations from two sets to a whole collection of sets.</mark-important>\n\n• The **union** of a collection of sets (`A₁, A₂, ..., Aₙ`) is the set of elements that are members of *at least one* set in the collection. It is denoted `∪ᵢ₌₁ⁿ Aᵢ`.\n\n• The **intersection** of a collection of sets is the set of elements that are members of *all* the sets in the collection. It is denoted `∩ᵢ₌₁ⁿ Aᵢ`.",
      "key_sentence": "Generalized unions and intersections extend the basic operations from two sets to a whole collection of sets.",
      "simple_explanation": "This is just union and intersection for a whole bunch of sets at once, not just two. 'Union' means you only need to be in at least one of the groups to be included. 'Intersection' means you must be in every single group.",
      "analogy": "Imagine 10 different group chats for a project. The generalized union is the master list of every person who is in at least one of those chats. The generalized intersection is the small group of people (like the project manager) who are members of all 10 chats.",
      "why_exists": "To provide a concise notation for applying union and intersection to an entire family of sets (not just a pair), which is common in higher-level mathematics and data analysis.",
      "note": "Operations on many sets",
      "exam_critical": false,
      "parent": 18,
      "subtitle": "Generalized Operations"
    }
  ]
}