{
  "title": "IS1106 Foundations of Web Technologies",
  "topic": "Internet Fundamentals",
  "content": [
    {
      "id": 1,
      "type": "section",
      "level": 1,
      "path": "Evolution of the Web",
      "title": "Evolution of the Web",
      "exam_text": "The web has evolved from a static, read-only medium (Web 1.0) to an interactive, user-driven platform (Web 2.0), and is moving towards an intelligent, machine-readable web (Web 3.0).",
      "full_text": "The Evolution of the Web describes the progression through distinct phases, each characterized by its dominant technologies, user interaction models, and overall philosophy.\n\n• <mark-key>Web 1.0</mark-key>: The 'Static Web' focused on one-way information broadcasting from producers to consumers.\n• <mark-key>Web 2.0</mark-key>: The 'Social Web' emphasizes user-generated content, collaboration, and two-way communication.\n• <mark-key>Web 3.0</mark-key>: The emerging 'Semantic Web' aims to make information machine-readable, enabling intelligent automation and personalization.",
      "key_sentence": "The web has evolved from a static, read-only medium (Web 1.0) to an interactive, user-driven platform (Web 2.0), and is moving towards an intelligent, machine-readable web (Web 3.0).",
      "simple_explanation": "Think of the web's history in three stages: first, it was like a digital library where you could only read (Web 1.0). Then, it became like a giant party where everyone could talk and share things (Web 2.0). Now, it's trying to become a smart assistant that understands what you want (Web 3.0).",
      "analogy": "It's like the evolution of media: Web 1.0 is a newspaper (you can only read it). Web 2.0 is social media (you can post, comment, and share). Web 3.0 is a smart home device that understands your requests and acts on them.",
      "why_exists": "This framework helps us understand how technology and user expectations have changed over time, from passive consumption to active participation and now towards intelligent interaction.",
      "note": "Core concept",
      "exam_critical": true,
      "subtitle": "Evolution of the Web"
    },
    {
      "id": 2,
      "type": "concept",
      "level": 2,
      "path": "Evolution of the Web > World Wide Web (WWW)",
      "title": "World Wide Web (WWW)",
      "exam_text": "The <mark-key>World Wide Web</mark-key> (WWW) is an information-sharing model built on top of the Internet. It is a collection of interconnected electronic documents called web pages.",
      "full_text": "The World Wide Web, or simply the Web, is a system for accessing and sharing information over the Internet. It is not the same as the Internet itself.\n\n**Key Characteristics:**\n• It's an **information-sharing model**, not the physical network.\n• It is built **on top of the Internet** infrastructure.\n• Consists of a global collection of electronic documents (<mark-key>web pages</mark-key>).\n• Web pages can contain text, graphics, audio, video, and hyperlinks to other documents.",
      "key_sentence": "The World Wide Web (WWW) is an information-sharing model built on top of the Internet.",
      "simple_explanation": "The Web is like all the books and magazines in a giant global library. The Internet is the library building itself and the road system that lets you get there. You use the Internet (the roads) to access the Web (the books).",
      "analogy": "The Internet is the electrical grid in your house. The World Wide Web is one of the things you can plug into it, like your TV, which displays shows and movies (web pages).",
      "why_exists": "It was created by Tim Berners-Lee to provide a user-friendly way for scientists to share and link research documents across different computer systems, simplifying information access on the complex Internet.",
      "note": "Key distinction",
      "exam_critical": true,
      "parent": 1,
      "subtitle": "World Wide Web (WWW)"
    },
    {
      "id": 3,
      "type": "concept",
      "level": 2,
      "path": "Evolution of the Web > The Internet",
      "title": "The Internet",
      "exam_text": "The <mark-key>Internet</mark-key> is the massive, global network of interconnected computer networks. It provides the physical infrastructure that services like the WWW, email, and file sharing run on.",
      "full_text": "The Internet is the foundational global network that connects millions of individual computer networks. It's the hardware and protocol layer that allows data to move around the world.\n\n**Key Characteristics:**\n• It is a **physical network** of computers, servers, routers, and cables.\n• It is decentralized, with **no single owner** or formal management.\n• It provides the infrastructure for many services, including the World Wide Web, email, and online gaming.\n• It moves data and information through cyberspace, connecting devices globally.",
      "key_sentence": "The Internet is the massive, global network of interconnected computer networks.",
      "simple_explanation": "The Internet is the global system of roads, pipes, and wires that connects everything. The websites, apps, and emails are the cars, water, and electricity that travel through that system.",
      "analogy": "The Internet is the entire postal service system—the trucks, planes, and post offices. The World Wide Web is the collection of letters and packages sent through that system.",
      "why_exists": "It originated from a US military project (ARPANET) to create a decentralized communication network that could survive a major outage, a design that proved perfect for creating a robust global public network.",
      "note": "vs. WWW",
      "exam_critical": true,
      "parent": 1,
      "subtitle": "The Internet"
    },
    {
      "id": 4,
      "type": "concept",
      "level": 2,
      "path": "Evolution of the Web > Web 1.0",
      "title": "Web 1.0: The Static Web",
      "exam_text": "<mark-critical>Web 1.0</mark-critical> was the first stage of the web, characterized by static, read-only websites where information flowed one-way from a content producer to a passive consumer.",
      "full_text": "Web 1.0, widely used from the mid-1990s to the early 2000s, is considered the 'read-only' web.\n\n**Core Characteristics:**\n• **One-way Communication**: Information was broadcasted from a webmaster to an audience, like a digital brochure.\n• **Static Content**: Pages were built with simple HTML and were not interactive or dynamic.\n• **Limited User Interaction**: Users were passive consumers of information with no ability to contribute, comment, or interact with the content.\n• **Content from Producer**: A small number of people created content for a large audience.",
      "key_sentence": "Web 1.0 was the first stage of the web, characterized by static, read-only websites where information flowed one-way from a content producer to a passive consumer.",
      "simple_explanation": "Web 1.0 was like a digital newspaper or encyclopedia. You could go online and read information, but you couldn't comment, share, or create your own content. It was a one-way street for information.",
      "analogy": "Web 1.0 is like watching broadcast television. The TV station sends out a show, and everyone at home watches it. You can't change the show or talk back to the characters.",
      "why_exists": "This was the simplest way to get information online using the new technologies of the time (HTML, web servers). The focus was on publishing existing information, not creating a platform for interaction.",
      "note": "Read-Only Web",
      "exam_critical": true,
      "parent": 1,
      "subtitle": "Web 1.0"
    },
    {
      "id": 5,
      "type": "list",
      "level": 3,
      "path": "Evolution of the Web > Web 1.0 > Disadvantages",
      "title": "Disadvantages of Web 1.0",
      "exam_text": "Web 1.0 was limited by its read-only nature, minimal user interaction, basic keyword search, and a lack of standards.",
      "full_text": "The limitations of Web 1.0 directly led to the development of Web 2.0.",
      "key_sentence": "The limitations of Web 1.0 directly led to the development of Web 2.0.",
      "simple_explanation": "The early web was boring and not very useful. You could only read things, you couldn't really participate, searching was bad, and every website was built differently.",
      "analogy": "It's like having a library where all the books are behind glass. You can look but can't add your own notes in the margins, discuss the book with others, or easily find what you're looking for.",
      "why_exists": "These disadvantages highlighted a huge unmet need for a more interactive, collaborative, and user-friendly online experience, paving the way for the next evolution.",
      "items": [
        "EXAM: Read-only Web | FULL: **Read-only Web**: Users were passive consumers with no ability to create or modify content.",
        "EXAM: Limited Interaction | FULL: **Limited user interaction**: There were no comments, likes, sharing, or user profiles.",
        "EXAM: Basic Search | FULL: **Keyword based (dumb) search**: Search engines were primitive, relying on simple keyword matching within web directories.",
        "EXAM: Lack of Standards | FULL: **The Lack of standards**: Websites were often inconsistent and worked differently across various browsers."
      ],
      "note": "Key limitations",
      "exam_critical": false,
      "parent": 4,
      "subtitle": "Disadvantages"
    },
    {
      "id": 6,
      "type": "concept",
      "level": 2,
      "path": "Evolution of the Web > Web 2.0",
      "title": "Web 2.0: The Social Web",
      "exam_text": "<mark-critical>Web 2.0</mark-critical> is the second generation of the web, focused on user-generated content, collaboration, and interactivity. It transformed users from passive consumers to active producers of information.",
      "full_text": "Web 2.0, popularized around 2004, represents a paradigm shift towards a 'read-write' web, also known as the Social Web.\n\n**Core Characteristics:**\n• **Two-way Communication**: Users can create, share, and comment on content, interacting with both creators and other users.\n• **User-Generated Content**: Platforms like blogs, wikis (Wikipedia), and social media (Facebook, YouTube) are defined by content made by their users.\n• **Collaboration**: Technologies enable 'the wisdom of crowds,' where collective intelligence makes applications better (e.g., product reviews, social bookmarking).\n• **Rich User Experience**: Dynamic and interactive interfaces (using technologies like AJAX) create app-like experiences in the browser.",
      "key_sentence": "Web 2.0 is the second generation of the web, focused on user-generated content, collaboration, and interactivity.",
      "simple_explanation": "Web 2.0 is the internet you use every day. It's social media, YouTube, Wikipedia—places where you're not just reading, you're posting, commenting, liking, and creating the content that everyone else sees.",
      "analogy": "Web 2.0 is like a giant potluck dinner. Instead of one chef cooking for everyone (Web 1.0), everyone brings a dish to share, creating a massive, diverse, and interactive meal.",
      "why_exists": "Web 2.0 emerged to fulfill the desire for a more democratic and interactive internet. People wanted to connect with each other, share their own ideas and creations, and participate rather than just consume.",
      "note": "Read-Write Web",
      "exam_critical": true,
      "parent": 1,
      "subtitle": "Web 2.0"
    },
    {
      "id": 7,
      "type": "list",
      "level": 3,
      "path": "Evolution of the Web > Web 2.0 > Core Principles",
      "title": "Core Principles of Web 2.0",
      "exam_text": "Web 2.0 is built on three pillars: Community, Active Participation, and the Wisdom of Crowds.",
      "full_text": "The philosophy of Web 2.0 can be broken down into key principles that define its platforms.",
      "key_sentence": "The philosophy of Web 2.0 can be broken down into key principles that define its platforms.",
      "simple_explanation": "Web 2.0 works because it lets people form groups around shared interests, encourages everyone to create stuff instead of just consuming, and uses everyone's combined knowledge to make services smarter.",
      "analogy": "It's like a successful group project: you form a team (Community), everyone contributes their part (Active Participation), and the final result is better than what any one person could have done alone (Wisdom of Crowds).",
      "why_exists": "These principles articulate the shift in thinking from building websites (as static documents) to building platforms (as services that grow with user contribution).",
      "items": [
        "EXAM: Community | FULL: **Community**: Users organize into groups with common goals and interests, fostering collaboration.",
        "EXAM: Active Participation | FULL: **Active participation**: Users transition from a passive reading role to an active authoring role, creating and sharing content.",
        "EXAM: Wisdom of Crowds | FULL: **The Wisdom of Crowds**: The collective intelligence of users adds value. Applications get smarter as more people use them (e.g., Amazon reviews, Waze traffic data)."
      ],
      "note": "Defining ideas",
      "exam_critical": false,
      "parent": 6,
      "subtitle": "Core Principles"
    },
    {
      "id": 8,
      "type": "list",
      "level": 3,
      "path": "Evolution of the Web > Web 2.0 > Challenges",
      "title": "Challenges of Web 2.0",
      "exam_text": "Web 2.0's user-driven nature introduces challenges such as privacy issues, content control, misinformation, vandalism, and copyright infringement.",
      "full_text": "While Web 2.0 empowers users, it also creates significant challenges related to trust, safety, and information quality.",
      "key_sentence": "While Web 2.0 empowers users, it also creates significant challenges related to trust, safety, and information quality.",
      "simple_explanation": "When you let anyone post anything online, you run into problems. People's private info can get out, it's hard to control what gets posted, and some users will post lies, mess things up for others, or steal content.",
      "analogy": "It's like opening a public park. It's great for the community, but you also have to deal with graffiti (vandalism), people spreading rumors (misinformation), and respecting who owns what (copyright).",
      "why_exists": "These challenges are the direct downside of an open, user-controlled platform. They represent the ongoing struggle between fostering free expression and maintaining a safe, reliable environment.",
      "items": [
        "EXAM: Privacy | FULL: **Privacy issues**: Users share vast amounts of personal data, which can be misused.",
        "EXAM: Content Control | FULL: **Control of Content**: Platforms struggle to moderate harmful or false information effectively.",
        "EXAM: Trust & Vandalism | FULL: **User Trust & Vandalism**: On open platforms like wikis, malicious users can change or destroy content.",
        "EXAM: Copyright | FULL: **Plagiarism and Copyright infringement**: It's easy for users to illegally copy and share content they don't own."
      ],
      "note": "The downsides",
      "exam_critical": false,
      "parent": 6,
      "subtitle": "Challenges"
    },
    {
      "id": 9,
      "type": "list",
      "level": 2,
      "path": "Evolution of the Web > Web 1.0 vs Web 2.0",
      "title": "Comparison: Web 1.0 vs Web 2.0",
      "exam_text": "Web 1.0 featured personal websites, expert sources like Britannica, and content managed by a CMS. Web 2.0 shifted to blogs, user-driven sources like Wikipedia, and content managed on wikis.",
      "full_text": "The transition from Web 1.0 to Web 2.0 is marked by a clear shift from centralized, top-down models to decentralized, user-centric ones across various domains.",
      "key_sentence": "The transition from Web 1.0 to Web 2.0 is marked by a clear shift from centralized, top-down models to decentralized, user-centric ones across various domains.",
      "simple_explanation": "The old web was about experts creating content on their own sites (like an official encyclopedia). The new web is about everyone creating content together on shared platforms (like Wikipedia).",
      "analogy": "It's the difference between a lecture and a workshop. In a lecture (Web 1.0), one person talks and everyone else listens. In a workshop (Web 2.0), everyone participates and contributes to the outcome.",
      "why_exists": "This comparison table clearly illustrates the fundamental change in how information is created, shared, and managed on the web, highlighting the shift in power from institutions to individuals and communities.",
      "items": [
        "EXAM: Authoring | FULL: **Authoring**: *Web 1.0* - personal web sites | *Web 2.0* - blogging",
        "EXAM: Information Source | FULL: **Information sources**: *Web 1.0* - Britannica Online | *Web 2.0* - Wikipedia",
        "EXAM: Content Creation | FULL: **Content creation & maintenance**: *Web 1.0* - via CMS (Content Management System) | *Web 2.0* - via Wikis",
        "EXAM: Data Storage | FULL: **Data storage**: *Web 1.0* - local disk | *Web 2.0* - online disk (cloud)",
        "EXAM: Advertising | FULL: **Online advertising**: *Web 1.0* - banners | *Web 2.0* - Google AdSense",
        "EXAM: Payment | FULL: **Online payment**: *Web 1.0* - bank account | *Web 2.0* - PayPal"
      ],
      "note": "Key differences",
      "exam_critical": true,
      "parent": 1,
      "subtitle": "Web 1.0 vs Web 2.0"
    },
    {
      "id": 10,
      "type": "concept",
      "level": 2,
      "path": "Evolution of the Web > Web 3.0",
      "title": "Web 3.0: The Semantic/Intelligent Web",
      "exam_text": "<mark-critical>Web 3.0</mark-critical>, the 'Semantic Web', aims to make the web machine-readable. Its goal is to allow software agents to understand and interpret information to automate tasks and provide more intelligent services.",
      "full_text": "Web 3.0 is the next evolution of the web, focusing on creating a more intelligent and autonomous online experience. It is often called the <mark-key>Semantic Web</mark-key>.\n\n**Core Purpose:**\n• **Machine-Readable Web**: The primary goal is to structure web data so that machines (software agents) can understand the *meaning* (semantics) of information, not just display it.\n• **Machine-facilitated Understanding**: It emphasizes technologies that allow computers to understand relationships between data, enabling more advanced search, personalization, and automation.\n• **Decentralization**: Often associated with technologies like blockchain, AI, and the Internet of Things (IoT) to create a more decentralized, intelligent, and connected web.",
      "key_sentence": "Web 3.0, the 'Semantic Web', aims to make the web machine-readable.",
      "simple_explanation": "Imagine if the internet wasn't just pages for you to read, but data that your computer could actually understand. Web 3.0 is about making websites smarter so your phone's assistant could, for example, plan and book an entire vacation for you by understanding what hotels, flights, and reviews mean.",
      "analogy": "Web 2.0 is a cookbook with recipes for a human to read. Web 3.0 is a smart oven that can read the recipe itself, understand 'preheat to 400°F,' and do it automatically.",
      "why_exists": "Web 2.0 created a massive amount of unstructured user data. Web 3.0 exists to add a layer of meaning on top of this data, so that intelligent programs can sift through the noise and perform complex tasks for us.",
      "note": "Machine-Readable",
      "exam_critical": true,
      "parent": 1,
      "subtitle": "Web 3.0"
    }
  ]
}