{
  "title": "Theories of Information Systems 2",
  "topic": "IS 1104",
  "content": [
    {
      "id": 1,
      "type": "section",
      "level": 1,
      "path": "Information System Success",
      "exam_text": "Information System (IS) Success is measured by its positive impact on strategy, finances, quality, and people within an organization. It is the central element of organizational operations.",
      "full_text": "<mark-important>The success of an Information System is critical as it forms the heart of any modern organization.</mark-important> Its implementation influences five key areas that determine its overall value and effectiveness.",
      "exam_critical": true,
      "analogy": "An information system is like a company's nervous system. If it works well, the whole body (the company) is coordinated, efficient, and makes smart moves. If it's failing, everything becomes slow, clumsy, and disconnected.",
      "key_sentence": "The success of an Information System is critical as it forms the heart of any modern organization.",
      "simple_explanation": "A computer system in a company is successful if it helps the company make better plans, save money, improve work quality, and make employees' jobs better. It's the main engine that keeps the business running smoothly.",
      "title": "Information System Success",
      "why_exists": "Companies invest huge amounts of money in technology. They needed a way to figure out if that investment was actually paying off and making the business better, not just adding complexity.",
      "subtitle": "Information System Success"
    },
    {
      "id": 2,
      "type": "list",
      "level": 2,
      "path": "Information System Success > Five Factors of IS Success",
      "exam_text": "Five key factors influenced by IS implementation: Strategy, Revenue & Expenses, Quality, Impact on Individuals, and Impact on Organization.",
      "full_text": "The implementation of an information system directly influences five critical factors that determine its success:",
      "exam_critical": true,
      "analogy": "It's like grading a group project. You don't just look at the final presentation. You also grade the research (Strategy), the budget (Revenue & Expenses), the accuracy of the info (Quality), how much each person contributed (Impact on Individuals), and how it helped the whole class's understanding (Impact on Organization).",
      "items": [
        "EXAM: 1. Strategy | FULL: **Strategy**: How the IS helps the company identify opportunities and counter threats.",
        "EXAM: 2. Revenue & Expenses | FULL: **Revenue & Expenses**: How the IS helps cut costs and increase revenue.",
        "EXAM: 3. Quality | FULL: **Quality**: How the IS improves the quality of information and work output.",
        "EXAM: 4. Impact on individuals | FULL: **Impact on individuals**: How the IS affects employee productivity and job demands.",
        "EXAM: 5. Impact on Organization | FULL: **Impact on Organization**: How the IS changes the company's structure and decision-making processes."
      ],
      "key_sentence": "The implementation of an information system directly influences five critical factors that determine its success:",
      "parent": 1,
      "simple_explanation": "To know if a company's computer system is good, you check five things: Does it help with planning? Does it make or save money? Does it make work better? Does it help employees? And does it help the company as a whole?",
      "why_exists": "To break down the broad idea of 'success' into specific, measurable areas. This helps managers pinpoint where an IS is winning or failing.",
      "subtitle": "Five Factors of IS Success"
    },
    {
      "id": 3,
      "type": "concept",
      "level": 3,
      "path": "Information System Success > Five Factors of IS Success > Strategy",
      "exam_text": "<mark-key>Strategy</mark-key>: IS should help managers access information to make quick, accurate strategic decisions, identifying opportunities and fighting threats.",
      "full_text": "<mark-important>An information system contributes to strategy by helping managers identify external opportunities and threats, allowing for quick and accurate decision-making.</mark-important>\n\nNo business can survive without a solid strategy. An effective IS provides the necessary data to:\n• Analyze market trends (opportunities).\n• Monitor competitors (threats).\n• Evaluate internal strengths and weaknesses.\n• Support swift and sound strategic choices.",
      "exam_critical": false,
      "analogy": "An IS is like a ship's navigation system. It doesn't just show you where you are; it shows you weather patterns (threats), clear passages (opportunities), and the condition of your own ship, helping the captain (manager) plot the best course.",
      "key_sentence": "An information system contributes to strategy by helping managers identify external opportunities and threats, allowing for quick and accurate decision-making.",
      "parent": 2,
      "simple_explanation": "A good computer system acts like a lookout for a business. It helps managers spot good chances to grow and warns them about dangers from competitors, so they can make smart plans quickly.",
      "why_exists": "Businesses operate in a competitive environment. An IS provides the intelligence needed to outmaneuver rivals and adapt to market changes, which is the core of business strategy.",
      "subtitle": "Strategy"
    },
    {
      "id": 4,
      "type": "concept",
      "level": 3,
      "path": "Information System Success > Five Factors of IS Success > Revenue & Expenses",
      "exam_text": "<mark-key>Revenue & Expenses</mark-key>: IS can reduce operational costs by automating clerical tasks and improve revenue by enabling faster, more accurate decisions.",
      "full_text": "<mark-important>Information systems can minimize operational costs and increase revenue.</mark-important> They achieve this by:\n• **Reducing Costs**: Automating repetitive tasks, replacing more expensive manual labor with cheaper, faster computer processes.\n• **Increasing Revenue**: Providing high-quality information that allows executives to make timely and accurate decisions, leading to better sales and financial performance.",
      "exam_critical": false,
      "analogy": "An IS is like an automated checkout at a grocery store. It reduces the cost of hiring many cashiers (cutting expenses) and speeds up the lines, making customers happier and more likely to return (increasing revenue).",
      "key_sentence": "Information systems can minimize operational costs and increase revenue.",
      "parent": 2,
      "simple_explanation": "Computer systems help businesses save money by doing boring jobs automatically, which is cheaper than paying people to do them. They also help managers make smart choices faster, which can lead to making more money.",
      "why_exists": "The primary goal of most businesses is to be profitable. This factor directly measures how IT contributes to the bottom line by either cutting costs or boosting income.",
      "subtitle": "Revenue & Expenses"
    },
    {
      "id": 5,
      "type": "concept",
      "level": 3,
      "path": "Information System Success > Five Factors of IS Success > Quality",
      "exam_text": "<mark-key>Quality</mark-key>: IS improves the quality of information and work output compared to manual processing.",
      "full_text": "<mark-important>Information Systems enhance the quality of information and work output, moving beyond the limitations of manual processing.</mark-important>\n\nExamples of IS improving quality include:\n• **Word processing software**: Helps clerks create professional, error-free documents easily.\n• **PowerPoint software**: Enables executives to present ideas in a clear and attractive way.\n• **Drawing software (CAD)**: Allows engineers to create precise and detailed project plans.",
      "exam_critical": false,
      "analogy": "It's the difference between hand-drawing a poster and designing one in Canva. The software (IS) provides tools that make the final product look more professional, polished, and easier to create (higher quality).",
      "key_sentence": "Information Systems enhance the quality of information and work output, moving beyond the limitations of manual processing.",
      "parent": 2,
      "simple_explanation": "Using computer systems makes work look better and be more accurate than doing it by hand. Think of typing an essay versus handwriting it—the typed version is neater, easier to fix, and looks more professional.",
      "why_exists": "The quality of work and information directly impacts a company's reputation and effectiveness. IS provides tools to standardize and elevate that quality beyond what's possible manually.",
      "subtitle": "Quality"
    },
    {
      "id": 6,
      "type": "concept",
      "level": 3,
      "path": "Information System Success > Five Factors of IS Success > Impact on Individual",
      "exam_text": "<mark-key>Impact on Individual</mark-key>: IS can make jobs more demanding due to increased workload and pace, but can also improve personal productivity.",
      "full_text": "<mark-important>Information systems have a dual impact on individuals: they can improve personal productivity while also making jobs more demanding.</mark-important>\n\nThis impact includes:\n• **Increased Demands**: The pace of work often accelerates, and the workload can increase as systems allow for more tasks to be handled.\n• **Improved Productivity**: Employees can accomplish more in the same amount of time, effectively reducing the 'number of working hours' needed for a given output.\n• **Job Creation**: New roles are created to manage, maintain, and utilize these information systems.",
      "exam_critical": false,
      "analogy": "It's like getting a smartphone. You can now answer emails from anywhere, making you more productive (positive impact). But it also means work can reach you 24/7, making your job more demanding (negative impact).",
      "key_sentence": "Information systems have a dual impact on individuals: they can improve personal productivity while also making jobs more demanding.",
      "parent": 2,
      "simple_explanation": "Computer systems can make your job faster and help you get more done. But, they can also make your job more stressful because work moves quicker and you're expected to do more.",
      "why_exists": "A system is only successful if the people using it benefit. This factor ensures that the human element is considered, evaluating whether the technology helps or hinders employees.",
      "subtitle": "Impact on Individual"
    },
    {
      "id": 7,
      "type": "concept",
      "level": 3,
      "path": "Information System Success > Five Factors of IS Success > Impact on Organization",
      "exam_text": "<mark-key>Impact on Organization</mark-key>: IS can change an organization's internal structure and centralize decision-making power by providing timely and accurate information to management.",
      "full_text": "<mark-important>Information Systems can fundamentally alter an organization's internal structure and decision-making processes.</mark-important>\n\nKey organizational impacts:\n• **Structural Change**: The way information flows and is extracted changes, which can reshape departments and roles.\n• **Centralization of Power**: When management has access to timely, accurate, and quick information from across the company, it allows them to consolidate control and make key decisions centrally.",
      "exam_critical": false,
      "analogy": "An IS is like installing a central dashboard in a factory. Before, each section manager made their own decisions based on what they saw. Now, the factory owner can see everything on one screen and make decisions for the whole factory, changing who has the power.",
      "key_sentence": "Information Systems can fundamentally alter an organization's internal structure and decision-making processes.",
      "parent": 2,
      "simple_explanation": "When a company gets a new computer system, it can change how the company is set up. It can give top bosses more control because they can see all the important information in one place, letting them make all the big decisions.",
      "why_exists": "Technology doesn't just automate old processes; it creates new ways of working. This factor assesses the system's transformative effect on the business as a whole.",
      "subtitle": "Impact on Organization"
    },
    {
      "id": 8,
      "type": "section",
      "level": 1,
      "path": "DeLone and McLean's Success Model",
      "exam_text": "The <mark-critical>DeLone & McLean (D&M) IS Success Model</mark-critical> is a framework that defines and measures IS success through six interrelated dimensions. It was first introduced in 1992 and updated in 2003.",
      "full_text": "<mark-important>The DeLone and McLean (D&M) IS Success Model is a widely used framework for measuring the success of information systems.</mark-important> It proposes that success is a multidimensional concept and that these dimensions are causally related.\n\n**Key Points:**\n• **Original Model (1992)**: Defined six dimensions: system quality, information quality, use, user satisfaction, individual impact, and organizational impact.\n• **Updated Model (2003)**: Refined the dimensions, adding 'service quality' and combining 'individual' and 'organizational' impacts into 'net benefits'.",
      "exam_critical": true,
      "analogy": "It's like a comprehensive car review. A good review doesn't just give a single score. It rates the engine performance (System Quality), the GPS accuracy (Information Quality), the dealership service (Service Quality), how happy the driver is (User Satisfaction), and the car's overall value (Net Benefits).",
      "key_sentence": "The DeLone and McLean (D&M) IS Success Model is a widely used framework for measuring the success of information systems.",
      "simple_explanation": "The D&M model is like a report card for a company's computer system. Instead of one grade, it gives scores in six different areas (like how well it works, if the info is good, if the helpdesk is helpful) to give a full picture of whether the system is successful.",
      "title": "DeLone and McLean's Success Model",
      "why_exists": "Before this model, there was no standard way to measure if an IS was 'successful'. Researchers were measuring different things, so results couldn't be compared. D&M created a common language and framework for everyone to use.",
      "subtitle": "DeLone and McLean's Success Model"
    },
    {
      "id": 9,
      "type": "concept",
      "level": 2,
      "path": "DeLone and McLean's Success Model > History",
      "exam_text": "In 1980, Peter Keen raised the question of what the dependent variable in IS research should be, highlighting the lack of a scientific basis. In 1992, DeLone and McLean created their first IS Success Model to provide this scientific basis. It defined six dimensions: system quality, information quality, use, user satisfaction, individual impact, and organizational impact.",
      "full_text": "<mark-important>The original D&M model was created in 1992 to address a lack of scientific consensus on how to measure IS success.</mark-important>\n\n**Timeline:**\n• **1980**: Researcher Peter Keen highlighted that IS research lacked a clear 'dependent variable' — a standard measure of success.\n• **Post-1980**: Motivated by Keen, researchers tried to identify factors for IS success.\n• **1992**: DeLone and McLean reviewed existing literature and proposed their influential model with six distinct dimensions, creating a foundation for future research.",
      "exam_critical": false,
      "analogy": "It's like trying to judge the 'best athlete' before sports had defined statistics like batting averages or goals scored. Peter Keen said, 'We don't even know what to measure!' DeLone and McLean then created the first official 'stat sheet' for information systems.",
      "key_sentence": "The original D&M model was created in 1992 to address a lack of scientific consensus on how to measure IS success.",
      "parent": 8,
      "simple_explanation": "Back in the day, nobody could agree on what made a computer system 'good'. It was messy. In 1992, two guys named DeLone and McLean looked at all the ideas and created one clear model with six categories to finally measure success properly.",
      "why_exists": "To bring order to chaos. IS research was fragmented, with everyone using different metrics. The model provided a standardized, comprehensive framework that unified the field and allowed for comparable studies.",
      "subtitle": "History"
    },
    {
      "id": 10,
      "type": "concept",
      "level": 2,
      "path": "DeLone and McLean's Success Model > Updated Model (2003)",
      "exam_text": "Ten years after the original, DeLone and McLean proposed an updated model in 2003. This version added 'Service Quality' and consolidated 'Individual Impact' and 'Organizational Impact' into a single 'Net Benefits' dimension.",
      "full_text": "<mark-important>In 2003, DeLone and McLean updated their model based on a decade of research and feedback.</mark-important> Other researchers had found the original model incomplete and proposed extensions.\n\nThe key changes were:\n• **Addition of Service Quality**: The quality of support from the IT department was recognized as a critical factor.\n• **Consolidation into Net Benefits**: The two 'impact' dimensions were combined into a broader 'Net Benefits' category to capture the overall value to all stakeholders.\n• **Intention to Use**: Added as an alternative to 'Use', especially for mandatory systems.",
      "exam_critical": true,
      "analogy": "It's like Apple releasing a new iPhone. The first one was revolutionary (1992 model), but after 10 years of user feedback, they added new features like a better camera (Service Quality) and simplified the design (Net Benefits) to create an improved version (2003 model).",
      "key_sentence": "In 2003, DeLone and McLean updated their model based on a decade of research and feedback.",
      "parent": 8,
      "simple_explanation": "After 10 years, DeLone and McLean realized their first model could be better. They added a new category for how good the IT helpdesk is ('Service Quality') and combined the two 'impact' scores into one big 'Net Benefits' score to make it simpler and more complete.",
      "why_exists": "The nature of IT and its role in business had changed in the 10 years since the original model. The rise of the internet and service-oriented IT departments meant that 'Service Quality' had become too important to ignore.",
      "subtitle": "Updated Model (2003)"
    },
    {
      "id": 11,
      "type": "list",
      "level": 2,
      "path": "DeLone and McLean's Success Model > Six Dimensions (Updated)",
      "exam_text": "The six dimensions of the updated D&M model are: System Quality, Information Quality, Service Quality, Intention to Use/Use, User Satisfaction, and Net Benefits.",
      "full_text": "The updated D&M model's logic flows through its six dimensions:\n\n1.  **Quality Dimensions**: A system is evaluated based on its <mark-key>Information</mark-key>, <mark-key>System</mark-key>, and <mark-key>Service Quality</mark-key>.\n2.  **Usage & Satisfaction**: These qualities affect a user's <mark-key>Intention to Use</mark-key> the system and their <mark-key>User Satisfaction</mark-key> with it.\n3.  **Benefits**: The use of the system ultimately leads to <mark-key>Net Benefits</mark-key> (positive or negative).\n4.  **Feedback Loop**: The Net Benefits achieved then influence future User Satisfaction and Intention to Use, creating a cycle.",
      "exam_critical": true,
      "analogy": "It's a recipe for a successful restaurant. Good ingredients (Information Quality), a clean kitchen (System Quality), and friendly waiters (Service Quality) lead to customers wanting to eat there (Intention to Use) and enjoying their meal (User Satisfaction). This results in profits and good reviews (Net Benefits), which encourages more people to come back.",
      "items": [
        "EXAM: System Quality | FULL: **System Quality**: How well the technology itself performs (e.g., speed, reliability, ease of use).",
        "EXAM: Information Quality | FULL: **Information Quality**: The quality of the system's output (e.g., accuracy, relevance, timeliness).",
        "EXAM: Service Quality | FULL: **Service Quality**: The quality of support provided by the IT department (e.g., responsiveness, training, helpdesk).",
        "EXAM: Intention to Use / Use | FULL: **Intention to Use / Use**: The degree to which users utilize the system.",
        "EXAM: User Satisfaction | FULL: **User Satisfaction**: The user's overall feeling about using the system.",
        "EXAM: Net Benefits | FULL: **Net Benefits**: The extent to which the IS contributes to the success of stakeholders (e.g., improved productivity, cost savings)."
      ],
      "key_sentence": "The updated D&M model's logic flows through its six dimensions, from quality characteristics to usage, satisfaction, and finally to net benefits, with a feedback loop.",
      "parent": 8,
      "simple_explanation": "The D&M model says that if a computer system is built well, has good information, and has a helpful support team, then people will want to use it and be happy with it. When people use it, it creates good results for the company, which in turn makes people even happier to use it.",
      "why_exists": "To provide a logical, cause-and-effect structure for understanding IS success. It's not just a list of factors; it's a model that shows how they influence each other.",
      "subtitle": "Six Dimensions (Updated)"
    },
    {
      "id": 12,
      "type": "concept",
      "level": 3,
      "path": "DeLone and McLean's Success Model > Six Dimensions (Updated) > System Quality",
      "exam_text": "<mark-key>System Quality</mark-key>: Measures the desirable technical characteristics of the IS itself, focusing on performance and usability aspects like speed, reliability, and ease of use.",
      "full_text": "<mark-important>The dimension of System Quality refers to the desirable characteristics of the information system itself, focusing on its technical performance.</mark-important>\n\nThis is purely about the technology, not the information it produces. Key measures include:\n• **Usability**: Is the system easy to learn and use? (Perceived Ease of Use from TAM is a common measure).\n• **Performance**: Is it fast and efficient?\n• **Reliability**: Is it available when needed? Does it crash?\n• **Flexibility**: Can it adapt to different user needs?\n• **Integration**: Does it work well with other systems?",
      "exam_critical": true,
      "analogy": "This is like judging a car based on its engine, transmission, and handling. Does it start every time? Is the steering responsive? Is it fuel-efficient? It's not about where the car takes you, but how well the machine itself operates.",
      "key_sentence": "The dimension of System Quality refers to the desirable characteristics of the information system itself, focusing on its technical performance.",
      "parent": 11,
      "simple_explanation": "System Quality asks: Does the app or website work well? Is it fast or slow? Does it crash a lot? Is it easy to figure out how to use? It’s all about how good the technology is, not the information it shows you.",
      "why_exists": "Because even a system with perfect information is useless if it's constantly crashing, running too slowly, or is impossible for users to navigate. This dimension ensures the basic technical foundation is sound.",
      "subtitle": "System Quality"
    },
    {
      "id": 13,
      "type": "concept",
      "level": 3,
      "path": "DeLone and McLean's Success Model > Six Dimensions (Updated) > Information Quality",
      "exam_text": "<mark-key>Information Quality</mark-key>: Measures the desirable characteristics of the IS output, focusing on how useful and accurate the information is for the user.",
      "full_text": "<mark-important>The dimension of Information Quality concerns the quality of the output that the system produces.</mark-important> It's not about the system's speed, but the value of what it delivers.\n\nKey measures include:\n• **Accuracy**: Is the information correct?\n• **Timeliness**: Is the information up-to-date?\n• **Completeness**: Is all the necessary information present?\n• **Relevance**: Is the information useful for the task at hand?\n• **Understandability**: Is the information presented in a clear and concise format?",
      "exam_critical": true,
      "analogy": "This is like judging a news website. It doesn't matter how fast the page loads (System Quality) if the news articles are inaccurate, old, or full of typos. Information Quality is about the content itself.",
      "key_sentence": "The dimension of Information Quality concerns the quality of the output that the system produces.",
      "parent": 11,
      "simple_explanation": "Information Quality asks: Is the stuff the system shows you correct and useful? If you look up a sales report, are the numbers right? Is the information recent or from last year? Is it easy to understand?",
      "why_exists": "A technically perfect system that produces garbage information is a failure. This dimension ensures that the data and reports generated by the system are trustworthy and valuable for decision-making.",
      "subtitle": "Information Quality"
    },
    {
      "id": 14,
      "type": "concept",
      "level": 3,
      "path": "DeLone and McLean's Success Model > Six Dimensions (Updated) > Service Quality",
      "exam_text": "<mark-key>Service Quality</mark-key>: Measures the quality of support users receive from the IT department or support personnel. This was a key addition to the updated model.",
      "full_text": "<mark-important>The dimension of Service Quality represents the quality of the support that users receive from the IS department and IT support personnel.</mark-important>\n\nThis construct was an enhancement added to the updated D&M model and was not part of the original. It includes:\n• **Responsiveness**: How quickly does the helpdesk respond to issues?\n• **Assurance/Competence**: Is the support staff knowledgeable and able to solve problems?\n• **Empathy**: Does the support staff show care and provide individual attention?\n• **Training**: Is effective training provided to users?",
      "exam_critical": true,
      "analogy": "This is like the customer service for your phone or internet provider. The product itself might be great (System/Information Quality), but if you can't get helpful support when something goes wrong, your overall experience is poor. Service Quality measures the helpdesk and support team.",
      "key_sentence": "The dimension of Service Quality represents the quality of the support that users receive from the IS department and IT support personnel.",
      "parent": 11,
      "simple_explanation": "Service Quality asks: If you have a problem with the computer system, is the IT helpdesk actually helpful? Do they answer quickly? Do they know what they're doing? Are they friendly? It's all about the quality of the human support you get.",
      "why_exists": "As systems became more complex and central to business, the need for good support grew. A system can fail if users can't get help when they're stuck. This dimension was added to reflect the critical role of the IT support department.",
      "subtitle": "Service Quality"
    },
    {
      "id": 15,
      "type": "concept",
      "level": 3,
      "path": "DeLone and McLean's Success Model > Six Dimensions (Updated) > Intention to Use",
      "exam_text": "<mark-key>Intention to Use / Use</mark-key>: Represents the degree and manner in which an IS is utilized by users. 'Intention to use' is often used as a proxy, especially for mandatory systems.",
      "full_text": "<mark-important>The dimension of (Intention to) Use represents the degree and manner in which an IS is utilized by its users.</mark-important>\n\nMeasuring simple duration of use isn't always sufficient. Therefore, this concept is broad and can be measured from several perspectives:\n• **Nature of Use**: Is the system being used for its intended purpose?\n• **Frequency of Use**: How often do users access the system?\n• **Intention to Use**: Do users plan to use the system in the future? This is a crucial measure when system use is mandatory, as actual 'use' doesn't reflect a choice.",
      "exam_critical": false,
      "analogy": "This is like owning a gym membership. Just having the card ('use') doesn't mean you're getting fit. We need to know how often you go (frequency), what exercises you do (nature), and if you plan to keep going (intention). 'Use' is about more than just logging in.",
      "key_sentence": "The dimension of (Intention to) Use represents the degree and manner in which an IS is utilized by its users.",
      "parent": 11,
      "simple_explanation": "This dimension asks: Are people actually using the system? How often? Are they using it correctly? For systems that everyone is forced to use at work, it instead asks if people *want* to use it, which shows if they truly find it helpful.",
      "why_exists": "A system can't provide any benefits if nobody uses it. This dimension measures adoption and engagement, which is a necessary step between a 'good system' and 'good results'.",
      "subtitle": "Intention to Use"
    },
    {
      "id": 16,
      "type": "concept",
      "level": 3,
      "path": "DeLone and McLean's Success Model > Six Dimensions (Updated) > User Satisfaction",
      "exam_text": "<mark-key>User Satisfaction</mark-key>: Constitutes the user's level of satisfaction when utilizing an IS. It is a critical measure, especially when system use is mandatory.",
      "full_text": "<mark-important>The dimension of User Satisfaction captures a user's overall feelings and attitude about using the information system.</mark-important>\n\nIt is considered one of the most important measures of IS success because a system can be technically sound and provide benefits, but still fail if users hate using it.\n\nThis is particularly important in situations where:\n• **Use is mandatory**: The amount of use is not a good indicator of success because users have no choice. Their satisfaction level becomes the key metric for their opinion of the system.",
      "exam_critical": true,
      "analogy": "This is like asking someone how they feel about their company-issued work laptop. They have to use it (mandatory use), but are they happy with it? Is it fast and easy to use, or is it a constant source of frustration? Their satisfaction is a key measure of the laptop's success.",
      "key_sentence": "The dimension of User Satisfaction captures a user's overall feelings and attitude about using the information system.",
      "parent": 11,
      "simple_explanation": "User Satisfaction asks: Do people like using the system? Does it make them happy or frustrated? This is super important when people are forced to use a system for their job, because even if they use it, they might hate it, which means it's not truly successful.",
      "why_exists": "To capture the affective, or emotional, response of users. A system that frustrates its users can lead to low morale, workarounds, and hidden costs, even if it appears to be functioning correctly.",
      "subtitle": "User Satisfaction"
    },
    {
      "id": 17,
      "type": "concept",
      "level": 3,
      "path": "DeLone and McLean's Success Model > Six Dimensions (Updated) > Net Benefits",
      "exam_text": "<mark-key>Net Benefits</mark-key>: Measures the extent to which an IS contributes to the success of stakeholders at the individual, organizational, and even societal levels. It combines the original 'impact' dimensions.",
      "full_text": "<mark-important>The dimension of Net Benefits constitutes the extent to which an IS contributes to the success of its different stakeholders.</mark-important>\n\nThis is the ultimate measure of success and subsumes the original model's separate 'individual impact' and 'organizational impact' dimensions.\n\nBenefits can be measured at various levels:\n• **Individual**: Improved decision-making, increased productivity, learning.\n• **Organizational**: Cost reduction, increased output, improved competitive advantage, increased profitability.\n• **Societal**: Positive impacts on customers, suppliers, or the wider community.",
      "exam_critical": true,
      "analogy": "This is the 'bottom line' of a car review. After discussing the engine, GPS, and service, what is the final verdict? Does it save you money on gas? Does it make your commute better? Does it improve your family's safety? Net Benefits is the overall positive (or negative) outcome.",
      "key_sentence": "The dimension of Net Benefits constitutes the extent to which an IS contributes to the success of its different stakeholders.",
      "parent": 11,
      "simple_explanation": "Net Benefits asks: So what? Did the system actually make things better? Did it help employees do their job faster? Did it save the company money? Did it make the company more competitive? It’s the final score that measures the overall good things the system caused.",
      "why_exists": "To measure the ultimate success of an IS. A system can be well-liked and used often, but if it doesn't deliver tangible, positive outcomes for the organization and its people, it cannot be considered a success. This dimension links the system directly to value creation.",
      "subtitle": "Net Benefits"
    },
    {
      "id": 18,
      "type": "example",
      "level": 2,
      "path": "DeLone and McLean's Success Model > Pizza Hut Example",
      "exam_text": "*Pizza Hut's delivery system illustrates the D&M model: A reliable server (System Quality) with accurate order history (Information Quality) and a 30-minute delivery promise (Service Quality) leads to high usage and satisfaction, resulting in profit and competitive advantage (Net Benefits).*",
      "full_text": "*Pizza Hut's centralized call center and delivery system can be analyzed using the updated D&M model:*\n\n• <mark-key>System Quality</mark-key>: The 3C server reliably generates messages and sends them to the nearest outlet. It includes maps and shows previous customer orders, indicating good performance and features.\n\n• <mark-key>Information Quality</mark-key>: The system provides accurate details for the order (items, address) and accurately shows previous transactions, ensuring the kitchen and delivery person have correct information.\n\n• <mark-key>Service Quality</mark-key>: The promise of delivery within 30-45 minutes (or the pizza is free) is a strong measure of service quality. The website also facilitates special orders like 'Gift Pizzas'.\n\n• <mark-key>Intention to Use / Use</mark-key>: Customers use the system through both the hotline and the website, showing high utilization. Localized menus encourage use.\n\n• <mark-key>User Satisfaction</mark-key>: The free pizza policy for late deliveries is designed to maintain high customer trust and satisfaction. Features like gift-giving also enhance the user experience.\n\n• <mark-key>Net Benefits</mark-key>: The system directly leads to **profit** from the home delivery market. It provides a significant **competitive advantage** and has won awards.",
      "exam_critical": false,
      "analogy": "It's like a well-run Amazon delivery. The website works smoothly (System Quality), product info is correct (Information Quality), Prime delivery is fast (Service Quality), people use it constantly (Use), are happy with the service (Satisfaction), which results in massive profits for Amazon (Net Benefits).",
      "key_sentence": "Pizza Hut's centralized call center and delivery system can be analyzed using the updated D&M model.",
      "parent": 8,
      "simple_explanation": "Pizza Hut's ordering system is a great example of the D&M model. The computers work well, the order info is correct, and they promise fast delivery. This makes customers happy and want to order again. The final result is that Pizza Hut makes a lot of money and beats its competition.",
      "why_exists": "To demonstrate how the abstract dimensions of the D&M model can be applied to a real-world business information system to understand the sources of its success.",
      "subtitle": "Pizza Hut Example"
    },
    {
      "id": 19,
      "type": "section",
      "level": 1,
      "path": "Technology Acceptance Model (TAM)",
      "exam_text": "The <mark-critical>Technology Acceptance Model (TAM)</mark-critical> is a theory that explains why people choose to use a technology. It predicts acceptance based on two main factors: <mark-key>Perceived Usefulness (PU)</mark-key> and <mark-key>Perceived Ease of Use (PEOU)</mark-key>.",
      "full_text": "<mark-important>The Technology Acceptance Model (TAM) is an information system theory that explains how users come to accept and use a technology.</mark-important> Developed by Fred Davis in 1989, it is one of the most influential models for predicting user acceptance.\n\nThe central idea is that an individual's behavioral intention to use a system is determined by two key beliefs:\n• **Perceived Usefulness (PU)**: 'Will this help me do my job better?'\n• **Perceived Ease of Use (PEOU)**: 'Will this be easy for me to use?'",
      "exam_critical": true,
      "analogy": "TAM is like deciding whether to use a new social media app. You ask two questions: 1. 'Is this app useful for connecting with my friends or seeing cool stuff?' (Perceived Usefulness). 2. 'Is the app easy to navigate and post on?' (Perceived Ease of Use). If the answer to both is 'yes', you'll probably use it.",
      "key_sentence": "The Technology Acceptance Model (TAM) is an information system theory that explains how users come to accept and use a technology.",
      "simple_explanation": "TAM is a simple theory to guess if people will actually use a new piece of tech, like an app or website. It just asks two questions: 'Do you think it will be useful?' and 'Do you think it will be easy to use?' If people think 'yes' to both, they'll probably use it.",
      "title": "Technology Acceptance Model (TAM)",
      "why_exists": "Companies were building technically advanced systems that employees refused to use. TAM was created to explain this puzzle by focusing on user perceptions. It showed that it doesn't matter how powerful a system is if users don't believe it's useful or think it's too hard to learn.",
      "subtitle": "Technology Acceptance Model (TAM)"
    },
    {
      "id": 20,
      "type": "list",
      "level": 2,
      "path": "Technology Acceptance Model (TAM) > Variables of TAM",
      "exam_text": "The main variables of TAM are Perceived Usefulness (PU), Perceived Ease of Use (PEOU), Attitude Towards Use (A), Behavioral Intention to Use (BI), and External Variables.",
      "full_text": "The Technology Acceptance Model is built around a chain of key variables that influence each other:",
      "exam_critical": true,
      "analogy": "It's a chain reaction for deciding to use a new gadget. External factors (like a friend's recommendation) influence how useful and easy you think it is. Those thoughts shape your attitude ('I like this gadget!'). That attitude makes you decide to use it, and then you actually use it.",
      "items": [
        "EXAM: Perceived Usefulness (PU) | FULL: **Perceived Usefulness (PU)**: The belief that the technology will improve one's performance.",
        "EXAM: Perceived Ease of Use (PEOU) | FULL: **Perceived Ease of Use (PEOU)**: The belief that the technology will be free of effort.",
        "EXAM: Attitude Towards Use (A) | FULL: **Attitude Towards Use (A)**: The user's overall positive or negative feeling about using the technology.",
        "EXAM: Behavioral Intention to Use (BI) | FULL: **Behavioral Intention to Use (BI)**: The user's conscious plan or intention to use the technology.",
        "EXAM: Actual Use | FULL: **Actual Use**: The real-world usage of the technology.",
        "EXAM: External Variables | FULL: **External Variables**: Outside factors (social, cultural) that influence PU and PEOU."
      ],
      "key_sentence": "The Technology Acceptance Model is built around a chain of key variables that influence each other.",
      "parent": 19,
      "simple_explanation": "TAM has a few key parts: You first notice outside stuff (like what your friends use). This affects if you think the tech is useful and easy. Those two thoughts decide your attitude (if you like it or not). Your attitude decides if you plan to use it. And that plan leads to you actually using it.",
      "why_exists": "To break down the complex decision of adopting technology into a simple, logical sequence of psychological steps, making it easier to study and predict.",
      "subtitle": "Variables of TAM"
    },
    {
      "id": 21,
      "type": "concept",
      "level": 3,
      "path": "Technology Acceptance Model (TAM) > Variables of TAM > Perceived Usefulness (PU)",
      "exam_text": "<mark-key>Perceived Usefulness (PU)</mark-key>: The user's belief that using a specific system will enhance their job performance. It directly affects Attitude and Behavioral Intention.",
      "full_text": "<mark-important>Perceived Usefulness (PU) is defined as the degree to which a person believes that using a particular system would enhance his or her job performance.</mark-important>\n\nIt is a measure of the outcome or benefit a user expects to get from the technology. PU is considered the primary driver of adoption; if a technology isn't useful, its ease of use doesn't matter.\n\nIn the TAM model, PU directly influences both the user's **Attitude Towards Use** and their **Behavioral Intention to Use**.",
      "exam_critical": true,
      "analogy": "This is the 'why' behind using a tool. You use a calculator because you believe it will help you get the right answer faster and more accurately (enhancing your math performance). The calculator's usefulness is the main reason you pick it up.",
      "key_sentence": "Perceived Usefulness (PU) is defined as the degree to which a person believes that using a particular system would enhance his or her job performance.",
      "parent": 20,
      "simple_explanation": "Perceived Usefulness is simply asking: 'Will this thing actually help me?' If you believe an app will help you get your homework done faster or get a better grade, then it has high usefulness for you.",
      "why_exists": "To capture the most important reason people use technology at work: to get their job done better. This variable isolates the practical, results-oriented motivation for technology adoption.",
      "subtitle": "Perceived Usefulness (PU)"
    },
    {
      "id": 22,
      "type": "concept",
      "level": 3,
      "path": "Technology Acceptance Model (TAM) > Variables of TAM > Perceived Ease of Use (PEOU)",
      "exam_text": "<mark-key>Perceived Ease of Use (PEOU)</mark-key>: The degree to which a user expects a technology to be free of effort. It directly affects Attitude and also indirectly affects intention through PU.",
      "full_text": "<mark-important>Perceived Ease of Use (PEOU) is defined as the degree to which a person believes that using a particular system would be free of effort.</mark-important>\n\nThis variable indicates how easy a user finds the technology to operate. If a system is perceived as too difficult, users may believe the effort outweighs the benefits.\n\nIn the TAM model, PEOU has two effects:\n1.  **Direct Effect**: It influences the user's **Attitude Towards Use** (people prefer easy things).\n2.  **Indirect Effect**: It influences **Perceived Usefulness** (if something is easy, you're more likely to find it useful).",
      "exam_critical": true,
      "analogy": "This is the difference between using Instagram and using professional video editing software. Instagram is designed to be incredibly simple to post a photo (high PEOU). The easier it is, the more likely you are to use it and find it useful for sharing moments.",
      "key_sentence": "Perceived Ease of Use (PEOU) is defined as the degree to which a person believes that using a particular system would be free of effort.",
      "parent": 20,
      "simple_explanation": "Perceived Ease of Use is asking: 'Will this be easy, or a huge pain to learn?' If an app looks simple and not confusing, it has high ease of use. If it looks like it needs a 100-page manual, it has low ease of use.",
      "why_exists": "To account for the 'friction' of learning and using new technology. Even a very useful tool might be rejected if the effort required to use it is too high. PEOU measures this barrier to adoption.",
      "subtitle": "Perceived Ease of Use (PEOU)"
    },
    {
      "id": 23,
      "type": "concept",
      "level": 3,
      "path": "Technology Acceptance Model (TAM) > Variables of TAM > Attitude Towards Use (A)",
      "exam_text": "<mark-key>Attitude Towards Use (A)</mark-key>: The user's overall evaluation and personal feeling (positive or negative) about using a particular information system.",
      "full_text": "<mark-important>Attitude Towards the use of a system (A) is the user's evaluation of the desirability of employing a particular information system.</mark-important>\n\nIt's the user's overall feeling or perception about the application. This attitude is formed based on their beliefs about the system's usefulness (PU) and ease of use (PEOU).\n\nA positive attitude ('I like this system') will lead to a stronger intention to use it.",
      "exam_critical": false,
      "analogy": "This is your gut reaction to a new device. After thinking about its features (PU) and how simple it is to operate (PEOU), you form an overall opinion: 'This new phone is awesome!' or 'This new phone is frustrating.' That feeling is your attitude.",
      "key_sentence": "Attitude Towards the use of a system (A) is the user's evaluation of the desirability of employing a particular information system.",
      "parent": 20,
      "simple_explanation": "Attitude is just whether you like or dislike the technology. After thinking about if it's useful and easy, you decide, 'Yeah, this is cool' or 'Ugh, I hate this thing.' That feeling is your attitude.",
      "why_exists": "To act as a mediator between a user's beliefs (what they think about the system) and their intentions (what they plan to do). It captures the emotional or evaluative step in the decision-making process.",
      "subtitle": "Attitude Towards Use (A)"
    },
    {
      "id": 24,
      "type": "concept",
      "level": 3,
      "path": "Technology Acceptance Model (TAM) > Variables of TAM > Behavioral Intention to Use (BI)",
      "exam_text": "<mark-key>Behavioral Intention to Use (BI)</mark-key>: A measure of the likelihood that a person will employ the application or system. It is the immediate predecessor to actual use.",
      "full_text": "<mark-important>Behavioral Intention to Use (BI) measures the likelihood of a person employing the application or the system.</mark-important>\n\nThis is the final step before actual behavior. It represents a person's conscious decision and plan to use the technology in the future. In TAM, it is influenced by both Attitude and Perceived Usefulness. A strong intention is the best predictor of whether someone will actually use the system.",
      "exam_critical": false,
      "analogy": "This is the moment you say, 'Okay, I'm going to download that app' or 'I'm going to start using this software for my reports next week.' It's not the action itself, but the conscious decision to perform the action.",
      "key_sentence": "Behavioral Intention to Use (BI) measures the likelihood of a person employing the application or the system.",
      "parent": 20,
      "simple_explanation": "This is your plan. After deciding you like the app, your intention is when you say to yourself, 'Okay, I'm definitely going to use this later.' It's the final thought before you actually do it.",
      "why_exists": "According to psychological theories, intention is the most direct and powerful predictor of actual behavior. By measuring intention, the model can make a strong prediction about future use without having to wait and observe it.",
      "subtitle": "Behavioral Intention to Use (BI)"
    },
    {
      "id": 25,
      "type": "concept",
      "level": 3,
      "path": "Technology Acceptance Model (TAM) > Variables of TAM > External Variables",
      "exam_text": "<mark-key>External Variables</mark-key> in TAM are factors like social influence, culture, and politics that affect a user's perceptions of usefulness (PU) and ease of use (PEOU).",
      "full_text": "<mark-important>External variables are factors from the outside world that affect a user's internal beliefs about a technology's usefulness and ease of use.</mark-important> TAM acknowledges that people's perceptions don't form in a vacuum. Key external variables include:\n• **Social Factors**: Influence from peers, friends, or society (e.g., 'Everyone is on TikTok').\n• **Cultural Factors**: How technology is used differently across various cultures (e.g., WhatsApp in Malaysia vs. KakaoTalk in Korea).\n• **Political Factors**: The impact of politics on technology use (e.g., politicians using Facebook for campaigns).",
      "exam_critical": false,
      "analogy": "External variables are like the weather influencing your decision to go for a run. Your personal beliefs about running being useful (PU) and easy (PEOU) are key, but if it's pouring rain or all your friends are going for a run too (external factors), that will strongly influence your final decision.",
      "key_sentence": "External variables are factors from the outside world that affect a user's internal beliefs about a technology's usefulness and ease of use.",
      "parent": 20,
      "simple_explanation": "External variables are all the outside things that influence your opinion. For example, if all your friends are using a certain app (social factor), you're more likely to think it's useful. These outside influences shape your first impression of the tech.",
      "why_exists": "To make the model more realistic. It acknowledges that individual decisions are not made in isolation but are shaped by the environment, social pressures, and cultural context in which the user lives and works.",
      "subtitle": "External Variables"
    },
    {
      "id": 26,
      "type": "concept",
      "level": 2,
      "path": "Technology Acceptance Model (TAM) > Limitations of TAM",
      "exam_text": "TAM has limitations: it assumes people are rational and doesn't provide specific design advice on how to make technology useful or easy to use.",
      "full_text": "While highly influential, TAM has two main limitations:\n\n1.  **Assumption of Rationality**: <mark-important>The model assumes that people plan their behavior rationally, which isn't always true.</mark-important> Emotions, habits, or other irrational factors can influence technology use.\n\n2.  **Lack of Design Guidance**: The model is descriptive, not prescriptive. It tells you *that* you need to make technology useful and easy to use, but it doesn't tell you *how* to design it that way. It offers no specific advice for building better technology.",
      "exam_critical": false,
      "analogy": "TAM is like a food critic who tells you a successful dish must be 'delicious' and 'easy to eat'. That's helpful to know (limitation 1), but it doesn't give you the actual recipe or cooking instructions (limitation 2). It also assumes you'll always pick the best-tasting food, ignoring things like brand loyalty or comfort food cravings.",
      "key_sentence": "The model assumes that people plan their behavior rationally, which isn't always true.",
      "parent": 19,
      "simple_explanation": "TAM isn't perfect. First, it thinks people always make logical choices, but sometimes we just do things because we feel like it. Second, it tells you that an app should be 'useful' and 'easy,' but it doesn't give you any tips on how to actually build an app that is useful and easy.",
      "why_exists": "Understanding the limitations of a model is crucial for using it correctly. These criticisms highlight areas where TAM might fall short and have led to the development of more comprehensive models like UTAUT.",
      "subtitle": "Limitations of TAM"
    },
    {
      "id": 27,
      "type": "example",
      "level": 2,
      "path": "Technology Acceptance Model (TAM) > ATM Example",
      "exam_text": "*ATM acceptance is explained by TAM: They are useful for transactions without a cashier (PU) and easier than using a passbook (PEOU), leading to a positive attitude and intention to use, influenced by external factors like the COVID-19 pandemic.*",
      "full_text": "*The widespread acceptance of Automated Teller Machines (ATMs) can be explained using TAM:*\n\n• <mark-key>Perceived Usefulness (PU)</mark-key>: ATMs are highly useful because they allow users to perform banking transactions like cash withdrawals and balance inquiries anytime, without needing a human cashier.\n\n• <mark-key>Perceived Ease of Use (PEOU)</mark-key>: Using an ATM is perceived as easy because transactions can be done quickly and without the involvement of a teller. It is simpler than visiting a bank branch.\n\n• <mark-key>Attitude Towards Use (A)</mark-key>: Users generally have a positive attitude toward ATMs because using a plastic card is more convenient and desirable than carrying and using a bank passbook.\n\n• <mark-key>Behavioral Intention (BI)</mark-key>: Younger people show a higher desire to use ATMs than older adults. Special offers linked to card usage also increase the intention to use them.\n\n• <mark-key>External Variables</mark-key>: Factors like being a student living away from home or the COVID-19 pandemic (to avoid human contact) increase the motivation to use ATMs.",
      "exam_critical": false,
      "analogy": "Choosing to use an ATM instead of a bank teller is a classic TAM decision. It's useful because it's open 24/7. It's easy because you just need a card and a PIN. These two beliefs create a positive attitude ('ATMs are great'), which leads to the intention to use one the next time you need cash.",
      "key_sentence": "The widespread acceptance of Automated Teller Machines (ATMs) can be explained using TAM.",
      "parent": 19,
      "simple_explanation": "Why do we all use ATMs? TAM explains it. We think they're useful because we can get cash anytime. We think they're easy because it's faster than waiting in line at the bank. Because of this, we like them and plan to use them. Things like the pandemic made us want to use them even more.",
      "why_exists": "To provide a clear, real-world application of the TAM theory, showing how the abstract variables of PU and PEOU translate into the adoption of a technology that is now part of everyday life.",
      "subtitle": "ATM Example"
    },
    {
      "id": 28,
      "type": "section",
      "level": 1,
      "path": "Unified Theory of Acceptance and Use of Technology (UTAUT)",
      "exam_text": "The <mark-critical>Unified Theory of Acceptance and Use of Technology (UTAUT)</mark-critical> explains user intention and usage behavior through four key constructs: Performance Expectancy, Effort Expectancy, Social Influence, and Facilitating Conditions.",
      "full_text": "<mark-important>The Unified Theory of Acceptance and Use of Technology (UTAUT) was developed by Venkatesh and others to synthesize previous technology acceptance models into one unified framework.</mark-important>\n\nUTAUT aims to provide a more comprehensive explanation of user interactions with an information system and their subsequent usage behavior. It identifies four key direct determinants of intention and behavior, and four key moderators.",
      "exam_critical": true,
      "analogy": "UTAUT is like the 'greatest hits' album of technology acceptance theories. Instead of listening to eight different albums (theories), Venkatesh took the best tracks (concepts) from all of them and put them together into one comprehensive collection that explains user behavior more powerfully.",
      "key_sentence": "The Unified Theory of Acceptance and Use of Technology (UTAUT) was developed by Venkatesh and others to synthesize previous technology acceptance models into one unified framework.",
      "simple_explanation": "UTAUT is like a super-model that combines a bunch of older, simpler models (like TAM) into one. It tries to explain why people use technology using four main ideas: Will it help me? Is it easy? Are other people using it? And do I have the stuff I need to use it?",
      "title": "Unified Theory of Acceptance and Use of Technology (UTAUT)",
      "why_exists": "There were too many competing models (TAM, Theory of Planned Behavior, etc.) trying to explain the same thing. UTAUT was created to consolidate the strengths of these models, reduce redundancy, and create a more powerful and accurate predictive tool for researchers and practitioners.",
      "subtitle": "Unified Theory of Acceptance and Use of Technology (UTAUT)"
    },
    {
      "id": 29,
      "type": "list",
      "level": 2,
      "path": "Unified Theory of Acceptance and Use of Technology (UTAUT) > Key Constructs and Moderators",
      "exam_text": "UTAUT has 4 key constructs (Performance Expectancy, Effort Expectancy, Social Influence, Facilitating Conditions) and 4 moderators (Gender, Age, Experience, Voluntariness).",
      "full_text": "The UTAUT model is defined by four core constructs that directly influence behavior, and four moderators that change the strength of those influences.",
      "exam_critical": true,
      "analogy": "Think of it like deciding to go to a party. Your decision is based on four things: how fun you think it will be (Performance), how hard it is to get there (Effort), if your friends are going (Social), and if you have a ride (Facilitating). These feelings are changed by moderators: your age might affect how much you care if it's fun, and your experience with parties might affect how hard you think it is to get there.",
      "items": [
        "EXAM: 1. Performance Expectancy | FULL: **Performance Expectancy**: Similar to Perceived Usefulness in TAM. Will it help me perform better?",
        "EXAM: 2. Effort Expectancy | FULL: **Effort Expectancy**: Similar to Perceived Ease of Use in TAM. How easy is it to use?",
        "EXAM: 3. Social Influence | FULL: **Social Influence**: How much do I believe important others think I should use the system?",
        "EXAM: 4. Facilitating Conditions | FULL: **Facilitating Conditions**: Do I have the organizational and technical resources to use the system?",
        "EXAM: Moderators | FULL: **Moderators (Gender, Age, Experience, Voluntariness)**: Personal factors that change how important each of the four constructs are to different people."
      ],
      "key_sentence": "The UTAUT model is defined by four core constructs that directly influence behavior, and four moderators that change the strength of those influences.",
      "parent": 28,
      "simple_explanation": "UTAUT says four things matter when you decide to use tech: 1. Will it help me? 2. Is it easy? 3. Are my friends/bosses using it? 4. Do I have the support/tools needed? The importance of these four things can change depending on who you are (your age, gender, experience) and if you have a choice to use it or not.",
      "why_exists": "To create a comprehensive model that not only identifies the direct drivers of technology use but also explains why these drivers affect different people in different ways.",
      "subtitle": "Key Constructs and Moderators"
    },
    {
      "id": 30,
      "type": "concept",
      "level": 3,
      "path": "Unified Theory of Acceptance and Use of Technology (UTAUT) > Key Constructs and Moderators > Performance Expectancy",
      "exam_text": "<mark-key>Performance Expectancy</mark-key>: The degree to which an individual believes that using the system will help them attain gains in job performance. Its influence is moderated by gender and age.",
      "full_text": "<mark-important>Performance expectancy is 'the degree to which an individual believes that using the system will help him or her to attain gains in job performance'.</mark-important>\n\nThis is the UTAUT equivalent of TAM's 'Perceived Usefulness' and is the strongest predictor of intention.\n\nAccording to the model, the influence of this factor on behavioral intention is moderated by **gender** and **age** (e.g., it may be more important for younger men).",
      "exam_critical": true,
      "analogy": "This is the 'get ahead' factor. When considering a new work software, you ask, 'Will this tool make me look good, get my work done faster, and help me get a promotion?' The belief that it will is Performance Expectancy.",
      "key_sentence": "Performance expectancy is 'the degree to which an individual believes that using the system will help him or her to attain gains in job performance'.",
      "parent": 29,
      "simple_explanation": "This is just like 'Perceived Usefulness.' It's the belief that using the technology will help you do your job better or be more successful. The theory says this matters more to men and younger people.",
      "why_exists": "To consolidate similar concepts from previous models (like Perceived Usefulness, outcome expectations) into a single, more powerful construct representing the utilitarian driver of technology adoption.",
      "subtitle": "Performance Expectancy"
    },
    {
      "id": 31,
      "type": "concept",
      "level": 3,
      "path": "Unified Theory of Acceptance and Use of Technology (UTAUT) > Key Constructs and Moderators > Effort Expectancy",
      "exam_text": "<mark-key>Effort Expectancy</mark-key>: The degree of ease associated with the use of the system. Its influence is moderated by gender, age, and experience.",
      "full_text": "<mark-important>Effort expectancy is 'the degree of ease associated with the use of the system'.</mark-important>\n\nThis is the UTAUT equivalent of TAM's 'Perceived Ease of Use'. It captures how much effort a user thinks the system will take to learn and operate.\n\nAccording to the model, its influence on behavioral intention is moderated by **gender**, **age**, and **experience** (e.g., it may be more important for older women with less experience).",
      "exam_critical": true,
      "analogy": "This is the 'headache' factor. When looking at new technology, you ask, 'Is this going to be a nightmare to set up and learn, or is it simple and intuitive?' The less of a headache you expect, the higher the Effort Expectancy.",
      "key_sentence": "Effort expectancy is 'the degree of ease associated with the use of the system'.",
      "parent": 29,
      "simple_explanation": "This is just like 'Perceived Ease of Use.' It's how easy you think the technology will be to use. The theory suggests this is a bigger deal for women, older people, and those who haven't used a lot of tech before.",
      "why_exists": "To combine related concepts about cognitive effort (like ease of use, complexity) from earlier theories into a single construct representing the usability barrier to adoption.",
      "subtitle": "Effort Expectancy"
    },
    {
      "id": 32,
      "type": "concept",
      "level": 3,
      "path": "Unified Theory of Acceptance and Use of Technology (UTAUT) > Key Constructs and Moderators > Social Influence",
      "exam_text": "<mark-key>Social Influence</mark-key>: The degree to which an individual perceives that important others believe they should use the new system. It is moderated by multiple factors.",
      "full_text": "<mark-important>Social influence is 'the degree to which an individual perceives that important others believe he or she should use the new system'.</mark-important>\n\nThis construct captures the effect of the social environment or workplace culture on an individual's decision.\n\nIts influence on behavioral intention is moderated by **gender**, **age**, **experience**, and **voluntariness** (e.g., it's more influential in mandatory settings and for older women early on).",
      "exam_critical": true,
      "analogy": "This is the 'peer pressure' factor. Even if you don't care about a new messaging app, if your boss and your entire team start using it for work communication, you will feel a strong pressure to use it too. That pressure is Social Influence.",
      "key_sentence": "Social influence is 'the degree to which an individual perceives that important others believe he or she should use the new system'.",
      "parent": 29,
      "simple_explanation": "This is about what other people think. If your boss, your coworkers, or your friends think you should use a certain technology, you're more likely to use it. It's basically peer pressure for tech.",
      "why_exists": "To formalize the powerful impact of social norms and pressure, which were often treated as just an 'external variable' in simpler models like TAM. UTAUT recognizes social factors as a core driver of adoption.",
      "subtitle": "Social Influence"
    },
    {
      "id": 33,
      "type": "concept",
      "level": 3,
      "path": "Unified Theory of Acceptance and Use of Technology (UTAUT) > Key Constructs and Moderators > Facilitating Conditions",
      "exam_text": "<mark-key>Facilitating Conditions</mark-key>: The degree to which an individual believes an organizational and technical infrastructure exists to support the use of the system. It influences actual use behavior.",
      "full_text": "<mark-important>Facilitating conditions are 'the degree to which an individual believes that an organizational and technical infrastructure exists to support use of the system'.</mark-important>\n\nThis refers to the practical support available to the user, such as training, a helpdesk, or necessary hardware. Unlike the other three constructs that predict *intention*, Facilitating Conditions are hypothesized to directly predict *actual use behavior*.\n\nIts influence is moderated by **age** and **experience**.",
      "exam_critical": true,
      "analogy": "This is the 'support system' factor. You might want to learn to play electric guitar (intention), but if you don't have a guitar, an amplifier, or access to lessons (facilitating conditions), you won't actually be able to do it. It's about having the necessary resources and support.",
      "key_sentence": "Facilitating conditions are 'the degree to which an individual believes that an organizational and technical infrastructure exists to support use of the system'.",
      "parent": 29,
      "simple_explanation": "This asks: 'Do I have the stuff I need to use this?' It means having the right computer, good internet, and a helpdesk to call if you get stuck. If you don't have this support, you can't use the tech, even if you want to.",
      "why_exists": "To account for the practical realities that can prevent technology use, even when a user is motivated. It acknowledges that intention is not enough; users also need tangible support and resources to turn intention into action.",
      "subtitle": "Facilitating Conditions"
    },
    {
      "id": 34,
      "type": "example",
      "level": 2,
      "path": "Unified Theory of Acceptance and Use of Technology (UTAUT) > Mobile Messaging Example",
      "exam_text": "*The adoption of mobile messaging apps in Turkey can be explained by UTAUT: Users believe it helps them contact friends (Performance Expectancy), it's easy to use (Effort Expectancy), their neighbors are using it (Social Influence), and user manuals are available (Facilitating Conditions).*",
      "full_text": "*The adoption of mobile messaging applications can be understood through the four UTAUT constructs:*\n\n• <mark-key>Performance Expectancy</mark-key>: A user believes the phone and messaging app will help them easily contact their friends. It's easier and faster to send a message than to make a phone call for many situations.\n\n• <mark-key>Effort Expectancy</mark-key>: Messaging apps are easy to use. You don't need to remember phone numbers (they're in your contacts), the phone is portable, and features like screenshots are simple.\n\n• <mark-key>Social Influence</mark-key>: A user sees that their neighbors, family, and friends are all using mobile phones and chatting on these apps, creating a social norm to do the same.\n\n• <mark-key>Facilitating Conditions</mark-key>: The technology is supported by user manuals, online help, and the general infrastructure of mobile networks and app stores.",
      "exam_critical": false,
      "analogy": "It's like why everyone started using Zoom during the pandemic. It helped you do your job/school (Performance). It was pretty easy to figure out (Effort). Everyone else was using it (Social). And your company/school provided links and support (Facilitating). All four factors drove its rapid adoption.",
      "key_sentence": "The adoption of mobile messaging applications can be understood through the four UTAUT constructs.",
      "parent": 28,
      "simple_explanation": "Why does everyone use apps like WhatsApp? UTAUT explains: You think it will help you talk to friends (performance). It's easy to use (effort). All your friends are on it (social). And you have a phone and internet to run it (facilitating conditions).",
      "why_exists": "To show how the four constructs of UTAUT work together to explain a real-world phenomenon—the near-universal adoption of mobile messaging—in a more complete way than a simpler model like TAM could.",
      "subtitle": "Mobile Messaging Example"
    },
    {
      "id": 35,
      "type": "section",
      "level": 1,
      "path": "Technology Resistance Theories",
      "exam_text": "<mark-critical>Technology Resistance Theories</mark-critical> explore why individuals resist or reject new technologies, a topic less studied than technology acceptance.",
      "full_text": "<mark-important>While much IS research focuses on why people use technology, Technology Resistance Theories investigate the opposite question: why do individuals resist or reject new technologies?</mark-important>\n\nThis area of research acknowledges that non-adoption isn't just a failure of acceptance; it can be an active, intentional behavior. Understanding resistance is crucial for successful IT implementation.",
      "exam_critical": false,
      "analogy": "If acceptance theories are about why people join a new club, resistance theories are about why people refuse to join, or why they quit after the first meeting. It's studying the 'no' instead of the 'yes'.",
      "key_sentence": "While much IS research focuses on why people use technology, Technology Resistance Theories investigate the opposite question: why do individuals resist or reject new technologies?",
      "simple_explanation": "Most theories are about why people like and use new tech. These theories are about the opposite: why people hate and refuse to use new tech. It's about understanding why people say 'no'.",
      "title": "Technology Resistance Theories",
      "why_exists": "Because in the real world, many expensive IT projects fail because employees actively or passively resist them. Acceptance models didn't fully explain this negative reaction, so new theories were needed to understand and manage resistance.",
      "subtitle": "Technology Resistance Theories"
    },
    {
      "id": 36,
      "type": "list",
      "level": 2,
      "path": "Technology Resistance Theories > Key Definitions",
      "exam_text": "Key terms in resistance are: Resistance (actively trying to prevent), Rejection (dismissing as faulty), and Non-adoption (choosing not to use).",
      "full_text": "It's important to distinguish between different forms of non-use:",
      "exam_critical": true,
      "analogy": "Imagine a new company policy. Resistance is organizing a protest against it. Rejection is reading it, declaring it's a stupid policy, and throwing it in the trash. Non-adoption is simply ignoring the policy and continuing to do things the old way.",
      "items": [
        "EXAM: Resistance | FULL: **Resistance**: Actively fighting against a technology. It means trying to prevent it from being used, through action or argument.",
        "EXAM: Rejection | FULL: **Rejection**: Dismissing a technology as inadequate or faulty and refusing to consider it.",
        "EXAM: Non-adoption | FULL: **Non-adoption**: The simple choice not to take up or follow an option. It's more passive than resistance or rejection."
      ],
      "key_sentence": "It's important to distinguish between different forms of non-use.",
      "parent": 35,
      "simple_explanation": "There are different ways to say 'no' to tech. 'Resistance' is when you actively fight it. 'Rejection' is when you look at it and say 'this is garbage' and ignore it. 'Non-adoption' is when you just quietly choose not to use it.",
      "why_exists": "To provide a more precise vocabulary for studying non-use. Lumping all non-users together is inaccurate; the reasons for active resistance are very different from the reasons for passive non-adoption.",
      "subtitle": "Key Definitions"
    },
    {
      "id": 37,
      "type": "concept",
      "level": 2,
      "path": "Technology Resistance Theories > Power and Politics",
      "exam_text": "Markus (1983) explained resistance in terms of power and politics. Users will resist a system if they believe it will cause them to <mark-key>lose power or influence</mark-key> within the organization.",
      "full_text": "<mark-important>The 'Power, Politics, and MIS Implementation' theory by Markus (1983) posits that resistance is a political behavior, not a technical one.</mark-important>\n\nAccording to this view:\n• A group of users will be inclined to use a system if they believe it will support or enhance their position of power.\n• Conversely, if users think a new system might cause them to lose power, influence, or control over resources, they will resist its implementation.",
      "exam_critical": true,
      "analogy": "Imagine a company introduces a new system that lets the CEO track every salesperson's client calls in real-time. The sales managers, who used to be the only ones with this information, might resist the system because it reduces their power and control over their team. Their resistance isn't about the software; it's about protecting their status.",
      "key_sentence": "The 'Power, Politics, and MIS Implementation' theory by Markus (1983) posits that resistance is a political behavior, not a technical one.",
      "parent": 35,
      "simple_explanation": "This theory says people resist new tech if they think it will make them less important at work. If a new system takes away control or power from someone, they will fight against it to protect their job status.",
      "why_exists": "To explain why technically sound systems sometimes fail due to organizational politics. It shifted the focus from user 'irrationality' to understanding resistance as a rational response to a perceived threat to one's power and influence.",
      "subtitle": "Power and Politics"
    },
    {
      "id": 38,
      "type": "concept",
      "level": 2,
      "path": "Technology Resistance Theories > Equity Theory Perspective",
      "exam_text": "Joshi (1991) used equity theory to explain resistance. Users evaluate a new system based on its impact on their <mark-key>equity status</mark-key>, comparing their own gains and losses to those of others.",
      "full_text": "<mark-important>Joshi's (1991) model views resistance to change from an equity theory perspective.</mark-important> It suggests that users perform a three-level evaluation of a new system:\n\n1.  **Evaluate Net Gain**: Users assess the changes to their own inputs (e.g., more work, learning new skills) and outcomes (e.g., pay, recognition).\n2.  **Compare with Others**: They then compare their net gain with the net gain of other users or groups.\n3.  **Resist if Unfair**: If they perceive the change as inequitable—meaning they have to put in more effort for less reward compared to others—they will resist.",
      "exam_critical": false,
      "analogy": "It's like two coworkers getting new job duties. If you get a lot of extra work (input) for no extra pay (outcome), while your coworker gets a little extra work for a big raise, you will perceive this as unfair (inequitable) and resist the change.",
      "key_sentence": "Joshi's (1991) model views resistance to change from an equity theory perspective.",
      "parent": 35,
      "simple_explanation": "This theory says people resist a new system if they feel it's unfair. They'll think, 'This new software makes my job way harder, but my coworker barely has to do anything different, and we still get paid the same.' If it feels unbalanced, they'll push back.",
      "why_exists": "To explain resistance based on perceptions of fairness. It shows that resistance isn't just about individual loss of power, but also about the relative distribution of costs and benefits across the organization.",
      "subtitle": "Equity Theory Perspective"
    },
    {
      "id": 39,
      "type": "section",
      "level": 1,
      "path": "Task-Technology Fit (TTF) Theory",
      "exam_text": "The <mark-critical>Task-Technology Fit (TTF) Theory</mark-critical> holds that IT will be used and improve performance if its capabilities are a good match for the tasks the user must perform. A good 'fit' is crucial.",
      "full_text": "<mark-important>The Task-Technology Fit (TTF) theory, proposed by Goodhue and Thompson (1995), states that IT is more likely to have a positive impact on individual performance and be used if the technology's capabilities match the tasks that the user must perform.</mark-important>\n\nThe core idea is that it's not enough for a technology to be good in general; it must be the right tool for the specific job at hand. The model assesses the relationship, or 'fit,' between the task characteristics and the technology characteristics.",
      "exam_critical": true,
      "analogy": "TTF is about using the right tool for the job. You wouldn't use a screwdriver to hammer a nail. A screwdriver is a good tool (technology characteristic), but it's a poor fit for the task of hammering. A hammer has a high task-technology fit for that job.",
      "key_sentence": "The Task-Technology Fit (TTF) theory, proposed by Goodhue and Thompson (1995), states that IT is more likely to have a positive impact on individual performance and be used if the technology's capabilities match the tasks that the user must perform.",
      "simple_explanation": "This theory is super simple: a technology will be successful if it's the right tool for the job. If you need to write an essay, a word processor is a great fit. If you need to bake a cake, a word processor is a terrible fit. The better the fit, the more successful the tech.",
      "title": "Task-Technology Fit (TTF) Theory",
      "why_exists": "To explain why some technically 'good' systems fail. TAM focuses on perceptions of usefulness, but TTF gets more specific: usefulness depends on what task you're trying to do. It provides a more objective measure by matching technology features directly to task requirements.",
      "subtitle": "Task-Technology Fit (TTF) Theory"
    },
    {
      "id": 40,
      "type": "example",
      "level": 2,
      "path": "Task-Technology Fit (TTF) Theory > Lecturer Example",
      "exam_text": "*Example of TTF: A lecturer needs to teach virtually (Task). Zoom and Teams have features for virtual delivery (Technology). This good fit leads to high utilization and improved performance.*",
      "full_text": "*An example of the TTF model in action is a lecturer delivering virtual classes:*\n\n• **Task Characteristics**: The lecturer needs to deliver lectures virtually to a group of students, share slides, and interact with them.\n\n• **Technology Characteristics**: Applications like Zoom and Teams are designed for virtual communication. They have features like screen sharing, chat, and breakout rooms.\n\n• **Task-Technology Fit**: There is a strong fit between the task of virtual teaching and the capabilities of Zoom/Teams.\n\n• **Performance Impacts & Utilization**: Because of the good fit, the technology is highly utilized, and it enables the lecturer to improve their individual performance by effectively teaching online.",
      "exam_critical": false,
      "analogy": "A photographer needs to edit high-resolution photos (task). Photoshop is a powerful software with layers, color correction tools, and RAW file support (technology). The features of Photoshop are an excellent fit for the task, leading the photographer to use it extensively and produce better work (performance).",
      "key_sentence": "An example of the TTF model in action is a lecturer delivering virtual classes.",
      "parent": 39,
      "simple_explanation": "Think about a teacher who has to teach online. The task is 'teach a class over the internet.' The technology is something like Zoom, which is built for video calls. Because Zoom is a perfect fit for the task, the teacher will use it and be able to do their job well.",
      "why_exists": "To provide a clear, practical illustration of the TTF model's components and how they link together to produce positive outcomes.",
      "subtitle": "Lecturer Example"
    },
    {
      "id": 41,
      "type": "concept",
      "level": 2,
      "path": "Task-Technology Fit (TTF) Theory > Combining with other theories",
      "exam_text": "TTF is often combined with other theories like TAM. The combined theory predicts that if a technology fits the task well, people will perceive it as more useful and be more likely to accept it.",
      "full_text": "<mark-important>TTF can be combined with other theories, such as TAM, to expand its explanatory power.</mark-important>\n\n**TTF combined with TAM**:\nThis combination creates a more powerful predictive model. The logic is as follows:\n1.  If a technology is a good fit for the task a person needs to perform (**TTF**).\n2.  Then that person is more likely to perceive the technology as useful (**Perceived Usefulness from TAM**).\n3.  This perception of usefulness will then lead them to accept and use the technology.",
      "exam_critical": false,
      "analogy": "It's like convincing someone to use a food processor. First, you show them it's great for the task of chopping vegetables (TTF). Because it fits the task so well, they then believe it's a genuinely useful kitchen gadget (TAM's PU). This belief makes them want to use it.",
      "key_sentence": "TTF can be combined with other theories, such as TAM, to expand its explanatory power.",
      "parent": 39,
      "simple_explanation": "You can mix and match theories. If you combine TTF and TAM, the idea is: if a technology is the perfect tool for your job (that's TTF), then you will probably think it's very useful (that's TAM), and because you think it's useful, you will use it.",
      "why_exists": "To create more robust and nuanced models. TTF explains the objective fit, while TAM explains the subjective perception. Combining them provides a fuller picture of why a technology succeeds, from its design characteristics to the user's mindset.",
      "subtitle": "Combining with other theories"
    }
  ]
}