{
  "title": "IS1106 Foundations of Web Technologies",
  "topic": "Web Technologies",
  "content": [
    {
      "id": 1,
      "type": "section",
      "level": 1,
      "path": "Web Browsers",
      "title": "Introduction to Web Browsers",
      "exam_text": "A web browser is a software program that accesses, interprets web code, and displays content from internet websites.",
      "full_text": "A <mark-key>web browser</mark-key> is a computer software program designed to access and display content from websites on the internet.\n\nIts core functions are to:\n• Interpret web programming code (like HTML, CSS, JavaScript).\n• Present the code visually as a webpage that users can interact with.\n\nDifferent browsers may interpret and display the same website slightly differently, which is why it's important to use modern, updated browsers for the best compatibility and security.",
      "key_sentence": "Web browsers are computer software programs that access and display content from Internet websites.",
      "simple_explanation": "It's the app you use to get on the internet, like Chrome, Safari, or Firefox. It turns website code into the pages you can see and click on.",
      "analogy": "A web browser is like a translator. The internet speaks in code (HTML, CSS), and the browser translates it into the visual language of websites, with text, images, and buttons you can understand.",
      "why_exists": "Early internet content was just text. To make it graphical and interactive, a special program was needed to read the code and 'draw' the webpage for the user.",
      "note": "Core concept",
      "exam_critical": true,
      "subtitle": "Web Browsers"
    },
    {
      "id": 2,
      "type": "list",
      "level": 2,
      "path": "Web Browsers > Browser Capabilities",
      "title": "Browser Capabilities",
      "exam_text": "Modern browsers can display static content, handle email, search, play media, and enable interaction with Web 2.0 applications.",
      "full_text": "Modern web browsers are powerful applications capable of many tasks beyond just viewing pages:\n• **Display static content:** Show text and images.\n• **Communication:** Read and send email.\n• **Information retrieval:** Search for information on the internet.\n• **Multimedia:** Play audio and video files.\n• **Web 2.0 Interaction:** Allow users to interact with websites and applications by adding or editing content (e.g., social media, blogs).",
      "key_sentence": "Modern browsers can display static content, handle email, search, play media, and enable interaction with Web 2.0 applications.",
      "simple_explanation": "Your browser does more than just show websites. You can use it to search Google, watch YouTube videos, check your email, and even interact with social media by posting content.",
      "analogy": "A web browser is like a digital Swiss Army knife for the internet. It has different tools for different tasks: a viewer for pages, a player for videos, a search tool, and a way to communicate.",
      "why_exists": "As the web evolved from simple documents to a platform for applications (like Google Docs or Facebook), browsers had to evolve to handle all these new types of content and interactions.",
      "items": [
        "EXAM: Static Content | FULL: **Display text and images** (static; not able to be changed).",
        "EXAM: Email | FULL: **Read and send E-mail**.",
        "EXAM: Search | FULL: **Search for information on the Internet**.",
        "EXAM: Multimedia | FULL: **Play audio and video files**, and other presentations.",
        "EXAM: Web 2.0 | FULL: **Access and provide social interaction** with Web 2.0 websites and computer-based applications (can add/edit website content)."
      ],
      "note": "Key functions",
      "exam_critical": false,
      "parent": 1,
      "subtitle": "Browser Capabilities"
    },
    {
      "id": 3,
      "type": "section",
      "level": 2,
      "path": "Web Browsers > Browser Selection Criteria",
      "title": "Considerations for Selecting a Browser",
      "exam_text": "When choosing a browser, evaluate four key factors: Compatibility & Capability, Ease of Use, Performance, and Security & Privacy.",
      "full_text": "Choosing the right web browser involves balancing several important factors to ensure a good user experience. The main considerations are:\n• **Compatibility and Capability:** Does it work with all websites and tools?\n• **Ease of Use:** Is it intuitive and easy to navigate?\n• **Performance:** Is it fast and stable?\n• **Security and Privacy:** Does it protect you from online threats?",
      "key_sentence": "When choosing a browser, evaluate four key factors: Compatibility, Ease of Use, Performance, and Security/Privacy.",
      "simple_explanation": "Picking a browser is like picking a car. You want one that works on all the roads you need to go (compatibility), is easy to drive (ease of use), is fast (performance), and has good locks and safety features (security).",
      "analogy": "It's like choosing a streaming service. Does it have all the shows you want to watch (Compatibility)? Is the app easy to navigate (Ease of Use)? Does it buffer a lot (Performance)? Does it protect your account info (Security)?",
      "why_exists": "Not all browsers are created equal. These criteria give users a framework to choose the best tool for their needs, as some might prioritize speed while others prioritize privacy.",
      "note": "Evaluation framework",
      "exam_critical": true,
      "parent": 1,
      "subtitle": "Browser Selection Criteria"
    },
    {
      "id": 4,
      "type": "concept",
      "level": 3,
      "path": "Web Browsers > Browser Selection Criteria > Compatibility and Capability",
      "title": "Compatibility and Capability",
      "exam_text": "Compatibility ensures a browser can correctly display all website features and integrate with other applications.",
      "full_text": "Compatibility refers to how well a browser can render websites as intended. A compatible browser should provide access to all needed websites and functionality.\n\nKey questions include:\n• Does it display all text and interactive elements correctly?\n• Can it integrate with other tools and applications you use?\n• Does it allow you to perform all necessary web tasks without issues?",
      "key_sentence": "A browser should provide access to all websites and functionality that is needed.",
      "simple_explanation": "This just means 'does it work everywhere?'. A compatible browser won't show you broken pages or prevent you from using a website's features.",
      "analogy": "Like checking if a video game is compatible with your console. A PS5 game won't work on a Nintendo Switch; similarly, a website might not work correctly on a very old or poorly made browser.",
      "why_exists": "Websites are built with code, and different browsers can interpret that code slightly differently. Compatibility is the measure of how well a browser follows the standard rules so that pages look and work the same for everyone.",
      "note": "Does it work?",
      "exam_critical": false,
      "parent": 3,
      "subtitle": "Compatibility and Capability"
    },
    {
      "id": 5,
      "type": "concept",
      "level": 3,
      "path": "Web Browsers > Browser Selection Criteria > Ease of Use",
      "title": "Ease of Use",
      "exam_text": "Ease of use refers to how intuitive and customizable the browser's interface is, including its layout and navigation.",
      "full_text": "This factor focuses on the user experience. A browser is easy to use if:\n• Its layout is simple and easy to understand.\n• Help features are readily available.\n• Navigation buttons (back, forward, refresh) are easy to find.\n• Its appearance and commands can be customized.",
      "key_sentence": "Ease of use refers to how intuitive and customizable the browser's interface is, including its layout and navigation.",
      "simple_explanation": "Is the browser easy to figure out? Can you find the back button and settings without a map? Can you change things like the theme or homepage easily?",
      "analogy": "Like the dashboard of a car. A well-designed dashboard has the speedometer, gas gauge, and radio controls right where you expect them. A browser with good ease of use feels just as natural.",
      "why_exists": "A browser is a tool used daily by billions. If it's confusing or frustrating, people won't use it, no matter how powerful it is. Good design makes technology accessible.",
      "note": "Is it simple?",
      "exam_critical": false,
      "parent": 3,
      "subtitle": "Ease of Use"
    },
    {
      "id": 6,
      "type": "concept",
      "level": 3,
      "path": "Web Browsers > Browser Selection Criteria > Performance",
      "title": "Performance",
      "exam_text": "Performance measures how quickly a browser loads pages and media, and how well it recovers from errors.",
      "full_text": "Performance is all about speed and stability. Key metrics include:\n• How long it takes to load a webpage.\n• How quickly it can load and play media like audio and video.\n• Its ability to recover from crashes or errors on a webpage.\n• The balance between security features and response time.",
      "key_sentence": "Performance measures how quickly a browser loads pages and media, and how well it recovers from errors.",
      "simple_explanation": "How fast is the browser? Does it take forever to load YouTube? Does it crash if a website has a bug? A high-performance browser is fast and doesn't freeze up.",
      "analogy": "Like comparing a sports car to a family minivan. Both get you there, but the sports car (high-performance browser) accelerates faster, handles better, and responds instantly.",
      "why_exists": "Users are impatient. A slow browser leads to a frustrating experience and can make people abandon a website. Performance is a critical factor for user satisfaction.",
      "note": "Is it fast?",
      "exam_critical": false,
      "parent": 3,
      "subtitle": "Performance"
    },
    {
      "id": 7,
      "type": "concept",
      "level": 3,
      "path": "Web Browsers > Browser Selection Criteria > Security and Privacy",
      "title": "Security and Privacy",
      "exam_text": "Security and privacy involve a browser's built-in measures to protect users from malware, pop-ups, and trackers, and the importance of keeping it updated.",
      "full_text": "This is about how well the browser protects you online. Important aspects are:\n• Built-in protection against threats like pop-ups, insecure plug-ins, and malware.\n• Regular updates from the vendor to fix security vulnerabilities.\n• Clear and understandable default security and privacy settings.",
      "key_sentence": "All browsers have some level of built-in security measures, to protect users from threats that can be introduced by popup windows, unsecure browser plug-ins, or erroneously acquired malware.",
      "simple_explanation": "Does the browser keep you safe from viruses and stop creepy ads from following you? Good security means it blocks bad stuff automatically and lets you control who sees your data.",
      "analogy": "A browser's security is like the security system for your house. It has locks on the doors (blocking malware), an alarm system (warning about shady websites), and curtains on the windows (privacy settings).",
      "why_exists": "The internet can be a dangerous place with viruses, scams, and data theft. Browsers are the first line of defense, so they need strong, built-in security features to protect users.",
      "note": "Is it safe?",
      "exam_critical": true,
      "parent": 3,
      "subtitle": "Security and Privacy"
    },
    {
      "id": 8,
      "type": "list",
      "level": 2,
      "path": "Web Browsers > Browser Security Practices",
      "title": "How to Increase Web Browser Security",
      "exam_text": "Key browser security practices include configuring privacy settings, disabling pop-ups, managing cookies, and restricting permissions for location, camera, and microphone.",
      "full_text": "<mark-important>Configuring your privacy settings is one of the most important things you can do to secure your web browser.</mark-important> Best practices include:\n• Disabling pop-ups and automatic redirections.\n• Preventing websites from starting downloads automatically.\n• Managing cookies to control tracking.\n• Restricting website access to your location, camera, and microphone.",
      "key_sentence": "Configuring your privacy settings is one of the most important things you can do to secure your web browser.",
      "simple_explanation": "To make your browser safer, you need to go into the settings and tighten things up. It's like locking your doors and windows—you should turn off pop-ups, block automatic downloads, and not let random websites use your camera.",
      "analogy": "It's like setting the privacy settings on your social media account. You don't want your profile to be public for everyone to see everything. You go in and choose who can see your posts, tag you in photos, and see your location.",
      "why_exists": "Browsers often come with default settings that prioritize convenience over security. These practices give users control over their data and reduce the risk of being exposed to malware or having their privacy invaded.",
      "items": [
        "EXAM: Disable Pop-ups | FULL: **Disable pop-ups and redirections.**",
        "EXAM: Block Auto-Downloads | FULL: **Don't allow automatic downloads.**",
        "EXAM: Manage Cookies | FULL: **Keep cookies in check.**",
        "EXAM: Restrict Permissions | FULL: **Restrict access to your location, camera, and microphone.**"
      ],
      "note": "User-controlled security",
      "exam_critical": true,
      "parent": 1,
      "subtitle": "Browser Security Practices"
    },
    {
      "id": 9,
      "type": "section",
      "level": 1,
      "path": "Web Servers",
      "title": "Introduction to Web Servers",
      "exam_text": "A web server is a computer that stores web content and hosts websites. Its power determines how busy a site can be.",
      "full_text": "A <mark-key>web server</mark-key> is a computer connected to the internet that stores the files (like HTML, images, CSS) that make up websites. Its primary job is to 'host' websites and deliver their content to a user's browser upon request.\n• A server can be anything from a desktop PC to a massive rack of dedicated machines.\n• The more traffic a website gets, the more powerful its server needs to be.\n• Large sites like Google use many redundant servers worldwide for reliability and speed.",
      "key_sentence": "A web server is a computer where the web content is stored and is used to host the web sites.",
      "simple_explanation": "A web server is a special computer that's always on and connected to the internet. It's where websites live. When you type a website address into your browser, you're asking that website's server to send you the page.",
      "analogy": "A web server is like a library. The websites are the books, and your browser is the person asking the librarian (the server) for a specific book. The server finds the book and gives it to you to read.",
      "why_exists": "Websites need a permanent, publicly accessible place to store their files. A web server provides this centralized location and the necessary software to handle requests from users all over the world, 24/7.",
      "note": "Core concept",
      "exam_critical": true,
      "subtitle": "Web Servers"
    },
    {
      "id": 10,
      "type": "list",
      "level": 2,
      "path": "Web Servers > Server Software",
      "title": "Web Server Software",
      "exam_text": "Web server software listens for HTTP requests from browsers and responds by sending back the requested resources like HTML pages or files.",
      "full_text": "Web server software is the program that runs on a server computer, waiting for incoming <mark-key>HTTP requests</mark-key>. When a request arrives, the software finds the requested resource (e.g., a webpage, video, PDF) and sends it back to the browser in an <mark-key>HTTP response</mark-key>.\n\nCommon examples of server software include:\n• <mark-critical>Apache HTTP Server</mark-critical>\n• <mark-critical>Microsoft IIS</mark-critical> (Internet Information Services)\n• <mark-critical>Google's GWS</mark-critical> (Google Web Server)",
      "key_sentence": "Software that sits there and patiently listens for incoming HTTP requests.",
      "simple_explanation": "If the server is the computer (the hardware), the server software is the brain (the program) that knows what to do. It's like a receptionist waiting for the phone to ring. When a browser calls (sends a request), the software answers and sends the right webpage.",
      "analogy": "It's like the operating system on your phone (e.g., iOS or Android). The phone itself is the hardware, but the OS is the software that manages calls, apps, and everything else. Web server software manages website requests.",
      "why_exists": "A computer alone doesn't know how to handle web traffic. Specialized software is needed to understand the HTTP protocol, manage multiple connections simultaneously, and serve files securely and efficiently.",
      "items": [
        "EXAM: Apache | FULL: **Apache HTTP Server**",
        "EXAM: Microsoft IIS | FULL: **Microsoft IIS** (Internet Information Services)",
        "EXAM: Google GWS | FULL: **Google's GWS** (Google Web Server)"
      ],
      "note": "Software vs Hardware",
      "exam_critical": true,
      "parent": 9,
      "subtitle": "Server Software"
    },
    {
      "id": 11,
      "type": "list",
      "level": 2,
      "path": "Web Servers > Server Security Practices",
      "title": "Web Server Security Practices",
      "exam_text": "Essential server security includes using a reverse proxy, access restrictions (SSH), regular patching, network monitoring, firewalls, and SSL for data encryption.",
      "full_text": "Securing a web server is critical to protect data and prevent unauthorized access. Key practices are:\n• **Reverse Proxy:** Hides the internal server from external traffic.\n• **Access Restriction:** Limit who can access server infrastructure, often using <mark-key>Secure Socket Shell (SSH)</mark-key>.\n• **Patching:** Keep server software updated to fix vulnerabilities.\n• **Network Monitoring:** Watch for suspicious or unauthorized activity.\n• **Firewall:** Monitors and controls incoming/outgoing network traffic.\n• **SSL (Secure Sockets Layer):** Encrypts data transmitted between the server and the user's browser.",
      "key_sentence": "Securing a web server is critical to protect data and prevent unauthorized access through methods like patching, monitoring, firewalls, and SSL.",
      "simple_explanation": "This is all about protecting the computer that holds the website. It involves putting a guard at the door (firewall), using secret passwords to get in (SSH), keeping the software updated against bugs (patching), and using a secret code for all communication (SSL).",
      "analogy": "Securing a web server is like securing a bank vault. You have security guards (monitoring), a thick steel door (firewall), special keys for employees only (access restriction), and armored trucks for moving money (SSL encryption).",
      "why_exists": "Web servers are a prime target for hackers who want to steal data, deface websites, or use the server for malicious activities. These security practices form layers of defense to protect the server and its data.",
      "items": [
        "EXAM: Reverse Proxy | FULL: **A reverse proxy** hides an internal server and acts as an intermediary.",
        "EXAM: Access Restriction | FULL: **Access restriction** limits access to infrastructure, for example by using Secure Socket Shell (SSH).",
        "EXAM: Patching | FULL: **Keeping web servers patched** and up to date to protect against vulnerabilities.",
        "EXAM: Monitoring | FULL: **Network monitoring** to check for unauthorized activity.",
        "EXAM: Firewall & SSL | FULL: **Using a firewall** to monitor HTTP traffic and **SSL (Secure Sockets Layer)** to keep data secure."
      ],
      "note": "Layered defense",
      "exam_critical": true,
      "parent": 9,
      "subtitle": "Server Security Practices"
    },
    {
      "id": 12,
      "type": "section",
      "level": 1,
      "path": "Internet Protocols",
      "title": "Introduction to Internet Protocols",
      "exam_text": "Internet protocols are the rules that clients and servers use to communicate over a network. Multiple protocols work together to make the web function.",
      "full_text": "<mark-key>Protocols</mark-key> are sets of rules that define how devices communicate. In the context of the internet, they are the agreed-upon methods for clients (like your browser) and servers to talk to each other.\n\n• There isn't one single protocol for the internet.\n• A combination of different protocols, each with a specific job, is required to make everything work together seamlessly.",
      "key_sentence": "Rules that describe the methods used for clients and servers to communicate with each other over a network.",
      "simple_explanation": "Protocols are like languages. For two people to talk, they both have to speak the same language. For your computer and a web server to talk, they both have to use the same set of rules, or protocols.",
      "analogy": "Internet protocols are like the rules of the road for data. They dictate things like the speed limit, who has the right-of-way, and how to signal a turn, ensuring that data packets travel from source to destination without crashing.",
      "why_exists": "Without standardized rules, communication would be chaotic. Every computer manufacturer would have its own way of sending data, and nothing would be compatible. Protocols create a universal language for the internet.",
      "note": "Rules of communication",
      "exam_critical": true,
      "subtitle": "Internet Protocols"
    },
    {
      "id": 13,
      "type": "concept",
      "level": 2,
      "path": "Internet Protocols > FTP",
      "title": "File Transfer Protocol (FTP)",
      "exam_text": "<mark-critical>FTP (File Transfer Protocol)</mark-critical> is a set of rules for exchanging files between computers over the internet, often used by developers to upload website files.",
      "full_text": "<mark-critical>FTP (File Transfer Protocol)</mark-critical> is a standard network protocol used for the transfer of computer files between a client and server on a computer network.\n• **Primary Use:** Web developers commonly use FTP to upload their website files (HTML, CSS, images) from their local computer to the web server.\n• **Other Uses:** It is also used for downloading large files or programs from a server to an individual computer.",
      "key_sentence": "A set of rules that allow files to be exchanged between computers on the Internet.",
      "simple_explanation": "FTP is basically a tool for moving files around on the internet. Think of it as a delivery truck for files, used to take your website's files and put them onto the web server so everyone can see them.",
      "analogy": "Using FTP is like using Dropbox or Google Drive to upload a file from your computer to the cloud so you can access it from anywhere. Developers do the same thing, but they're uploading website files to a web server.",
      "why_exists": "A simple, reliable method was needed to move entire files from one computer to another across the internet, especially for publishing content to the web. FTP was created specifically for this task.",
      "note": "Moving files",
      "exam_critical": true,
      "parent": 12,
      "subtitle": "FTP"
    },
    {
      "id": 14,
      "type": "concept",
      "level": 2,
      "path": "Internet Protocols > HTTP",
      "title": "Hypertext Transfer Protocol (HTTP)",
      "exam_text": "<mark-critical>HTTP (Hypertext Transfer Protocol)</mark-critical> is the protocol for exchanging web content like text, images, and other media between browsers and servers.",
      "full_text": "<mark-critical>HTTP (Hypertext Transfer Protocol)</mark-critical> is the foundation of data communication for the World Wide Web. It defines the rules for exchanging multimedia files (text, images, video, etc.).\n• **HTTP Request:** A web browser sends an HTTP request to a server to ask for a web page.\n• **HTTP Response:** The web server sends an HTTP response back to the browser, containing the requested page and its files.",
      "key_sentence": "A set of rules for exchanging files such as text, graphic images, sound, video, and other multimedia files on the Web.",
      "simple_explanation": "HTTP is the main 'language' used to ask for and receive websites. When you type an address in your browser, it sends an HTTP 'request' asking for the page. The server then sends back an HTTP 'response' with the page content.",
      "analogy": "HTTP is like ordering food at a restaurant. You (the browser) give your order (HTTP request) to the waiter. The waiter takes it to the kitchen (the web server), which prepares the food and brings it to your table (HTTP response).",
      "why_exists": "While FTP is for transferring whole files, a different protocol was needed specifically for requesting and displaying interconnected 'hypertext' documents (web pages). HTTP was created to be the protocol for the web.",
      "note": "Request/Response cycle",
      "exam_critical": true,
      "parent": 12,
      "subtitle": "HTTP"
    },
    {
      "id": 15,
      "type": "concept",
      "level": 2,
      "path": "Internet Protocols > TCP/IP",
      "title": "Transmission Control Protocol/Internet Protocol (TCP/IP)",
      "exam_text": "<mark-critical>TCP/IP</mark-critical> is the official communication protocol of the internet, where TCP ensures reliable transmission and IP handles addressing.",
      "full_text": "<mark-critical>TCP/IP</mark-critical> is a suite of communication protocols that forms the backbone of the internet. It is the official standard for internet communication.\n\nTCP and IP have different functions that work together:\n• **TCP (Transmission Control Protocol):** Manages how data is broken into smaller packets, sent, and reassembled correctly at the destination. It ensures no packets are lost and they are in the correct order.\n• **IP (Internet Protocol):** Manages the addressing of these packets, ensuring they are sent to the correct destination computer.\n\nTogether, TCP and IP ensure reliable, end-to-end communication across the internet.",
      "key_sentence": "TCP and IP have different functions that work together to ensure reliable communication over the Internet.",
      "simple_explanation": "TCP/IP is the internet's postal service. IP is like the address on the envelope, making sure it goes to the right house. TCP is like delivery confirmation, making sure every piece of the package arrives safely and in the right order.",
      "analogy": "Imagine sending a large puzzle in the mail. TCP breaks the puzzle into individual pieces, numbers them, and packs them into boxes. IP puts the destination address on each box. When the boxes arrive, the receiving TCP checks that all numbered pieces are there and puts the puzzle back together.",
      "why_exists": "A robust system was needed to send data reliably over a complex, global network where data packets could get lost or arrive out of order. TCP/IP solves this by breaking data down, addressing it, and verifying its arrival.",
      "note": "Internet's backbone",
      "exam_critical": true,
      "parent": 12,
      "subtitle": "TCP/IP"
    }
  ]
}